<html>
<head>
<title>SELFHTML: Hinweise zum Dokument</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="ta.htm"><b>Editorial</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC> Hinweise zum Dokument</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Haftung</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Themenumfang</b></a><br> 
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Zielgruppe und Ziel</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Copyright</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Versionenkontrolle</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>Adresse dieses Dokuments im WWW</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a7"><b>Downloadm&ouml;glichkeiten</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a8"><b>Verwendeter HTML-Standard</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a9"><b>Technische Bedingungen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a10"><b>Risiken und Nebenwirkungen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a11"><b>Spenden</b></a>
<p>
<hr noshade  size=1 width=50% align=left color=#6666CC>
<p>

<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC>Haftung</font></h2></a>
Dieses Dokument ist keine Publikation einer offiziellen Stelle. Das 
Dokument erhebt weder den Anspruch auf Vollst&auml;ndigkeit noch auf 
Fehlerfreiheit. F&uuml;r Fehler in kommerziellen WWW-Seiten, die auf 
falsche oder falsch verstandene Beschreibungen in diesem Dokument 
zur&uuml;ckzuf&uuml;hren sind, &uuml;bernimmt der Autor keine Haftung.



<p><spacer type=vertical size=30>
<a name="a2"><h2><font color=#6666CC>Themenumfang</font></h2></a>
Dieses Dokument beschreibt den zum Redaktionsschlu&szlig; g&uuml;ltigen 
Sprachstandard 3.2 von HTML, ferner die sog. &quot;Netscape-Extensions&quot; und
die Microsoft-Erweiterungen zu HTML. Dazu kommt eine Dokumentation der HTML-Erweiterungssprache JavaScript. Neben der reinen Dokumentation enth&auml;lt das Dokument Hintergrundwissen rund um das Thema Web Publishing sowie Tips f&uuml;r Grafiken und zum Verwalten eigener WWW-Projekte.
<p>
Die Dokumentation ist eine Mischung aus Referenz und Tutorial. Es will den 
heute und in n&auml;chster Zukunft relevanten HTML-Sprachbestand einigerma&szlig;en 
vollst&auml;ndig beschreiben, aber nicht in Form einer blo&szlig; systematischen 
Sammlung, sondern in Form eines lesbaren, einf&uuml;hrenden Dokuments.



<p><spacer type=vertical size=30>
<a name="a3"><h2><font color=#6666CC>Zielgruppe und Ziel</font></h2></a>
Zielgruppe sind alle Computer-Anwender, die einen WWW-Browser ihr eigen 
nennen, die m&ouml;glichst schon einige &quot;Surf&quot;-Erfahrungen 
im WWW gesammelt haben, und die nun wissen m&ouml;chten, wie man selbst solche 
Hypertext-Dateien erstellt. Vor allem aber Menschen, die sich privat, 
ehrenamtlich oder beruflich mit dem Erstellen von WWW-Seiten 
besch&auml;ftigen, sind angesprochen. Erkl&auml;rtes Ziel dieses 
Dokuments ist es, Menschen Mut zu machen, das, was sie zu sagen haben, 
selbst im WWW zu publizieren und dadurch aktiv an der World Wide Web 
Revolution teilzunehmen. Denn das Motto des WWW lautet: 
&quot;Everyone's a publisher&quot;.



<p><spacer type=vertical size=30>
<a name="a4"><h2><font color=#6666CC>Copyright</font></h2></a>
Dieses Dokument ist <b>Freeware</b> im Sinne des Software-Lizenzrechts. Die Regeln im einzelnen:
<ul>
<li>Das Kopieren und Weitergeben des Dokuments ist erlaubt.
<li>Das Ver&ouml;ffentlichen auf WWW-Servern, Online-Diensten oder Mailboxen ist erlaubt.
<li>Das Ver&ouml;ffentlichen auf Datentr&auml;gern wie CD-ROMs ist erlaubt, auch wenn diese Datentr&auml;ger kommerziell orientiert sind. 
<li>Das &Auml;ndern des Dokuments ist nicht erlaubt. Das gilt sowohl f&uuml;r den Inhalt als auch f&uuml;r das Dateiformat bzw. die Gestaltung. Auch das Entfernen unliebsamer Passagen ist nicht erlaubt.
<li>Das Dokument mu&szlig; stets in der vorliegenden Form und vollst&auml;ndig kopiert, weitergegeben oder anderweitig ver&ouml;fftentlicht werden - das Kopieren, Weitergeben oder Ver&ouml;ffentlichen von Teilen des Dokuments ist nicht erlaubt. Ma&szlig;geblich hierf&uuml;r ist die <img src="xgdown.gif" width=14 height=10 border=0 alt=" ">&nbsp;<a href="#a7"><b>Download-Datei</b></a>.
<li>Das Ver&ouml;ffentlichen des Dokuments auf WWW-Servern oder Datentr&auml;gern im Zusammenhang mit illegalem pornografischem Material oder nazistischem Gedankengut ist unerw&uuml;nscht und wird bei Entdeckung juristisch verfolgt.
</ul>
Wenn Sie dieses Dokument an einer neuen Stelle im WWW plazieren oder an anderer Stelle publizieren wollen, besorgen Sie sich das Dokument an einer der <img src="xgdown.gif" width=14 height=10 border=0 alt=" ">&nbsp;<a href="#a7"><b>Stellen zum Downloaden</b></a>. Da das Dokument bereits an so vielen Adressen im WWW steht, &uuml;bernimmt der Autor hierf&uuml;r keine Betreuung.
<p>
Bei Ver&ouml;ffentlichung auf CD-ROM oder vergleichbaren Datentr&auml;gern ist es eine feine Geste, dem Autor ein Belegexemplar zukommen zu lassen. Senden Sie dieses per Post an <i>TeamOne, z.Hd. Stefan M&uuml;nz, Kistlerhofstr. 111, D-81379 M&uuml;nchen</i>.


<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a5"><h2><font color=#6666CC>Versionenkontrolle</font></h2></a>
Version 1.0 (04.06.95)<br>
Version 2.0 (25.06.95)<br>
Version 2.11 (09.08.95)<br>
Version 2.12 (21.08.95)<br>
Version 3.0 (10.10.95)<br>
Version 3.11 (09.11.95)<br>
Version 3.2 (25.11.95)<br>
Version 3.3 (28.11.95)<br>
Version 3.4 (11.12.95)<br>
Version 4.0 (21.01.96)<br>
Version 5.0 (03.07.96)<br>
Version 5.1 (04.08.96)<br>
Version 6.0 (14.03.97)<br>
Version 6.1 (15.06.97)<br>



<p><spacer type=vertical size=30>
<a name="a6"><h2><font color=#6666CC>Adresse dieses Dokuments im WWW</font></h2></a>
Dieses Dokument steht an mehr als 100 Stellen im WWW. Bitte haben Sie Verst&auml;ndnis daf&uuml;r, das nicht an jeder Adresse die neueste Dokumentversion steht. Der Autor selbst pflegt nur eine dieser Adressen. Deshalb finden Sie auch nur dort mit Sicherheit die jeweils neueste Zwischenversion des Dokuments:
<p>
<img src="xgonline.gif" width=14 height=10 border=0 alt=" ">&nbsp;<a href="http://www.teamone.de/selfhtml/"><b>&quot;HTML-Dateien selbst erstellen&quot; auf www.teamone.de/selfhtml/</b></a>&nbsp;<img src="xdeu.gif" width=16 height=10 border=0>
<p>
F&uuml;r das Bekanntmachen der anderen Adressen haben die Verantwortlichen selbst zu sorgen.




<p><spacer type=vertical size=30>
<a name="a7"><h2><font color=#6666CC>Downloadm&ouml;glichkeiten</font></h2></a>
Im <b>WWW</b> k&ouml;nnen Sie jederzeit diese bzw. die aktuelle Version des Dokuments als <b>ZIP-Datei</b> an folgenden Stellen downloaden: 
<p>
<img src="xgonline.gif" width=14 height=10 border=0 alt=" ">&nbsp;<a href="http://www.teamone.de/download/selfhtml.zip">
<b>http://www.teamone.de/download/selfhtml.zip</b></a><br>
<img src="xgonline.gif" width=14 height=10 border=0 alt=" ">&nbsp;<a href="http://ourworld.compuserve.com/homepages/muenz/selfhtml.zip">
<b>http://ourworld.compuserve.com/homepages/muenz/selfhtml.zip</b></a><br>
<p>
Wenn Sie bei beiden Adressen keinen Erfolg haben, nerven Sie den Autor bitte nicht gleich mit Problemmeldungen. Versuchen Sie es zu einem anderem Zeitpunkt und einer g&uuml;nstigeren Tageszeit noch einmal.
<p>
<font color=#6666CC><b>Achtung:</b></font> Falls Sie bereits eine &auml;ltere Version (5.1 und niedriger) dieses Dokuments haben, l&ouml;schen Sie bitte vor dem Entpacken der neuen Version alle alten Dateien. Dadurch vermeiden Sie, da&szlig; Dateien mit alten Dateinamen im Verzeichnis stehen bleiben, die von neueren Versionen (ab 6.0) nicht mehr ben&ouml;tigt werden. Oder legen Sie die neue Version in einem eigenen Verzeichnis ab.
<p>
Es gibt weitere Stellen im WWW, an denen das Dokument downloadbar ist. F&uuml;r das Bekanntmachen der anderen Adressen haben die Verantwortlichen selbst zu sorgen, ebenso f&uuml;r das Aktualisieren der Versionen.
<p>
In <b>CompuServe</b> k&ouml;nnen Sie die jeweils neueste Version dieses Dokuments an folgender Stelle downloaden: 
<p>
<b>Deutsches Internet Forum (GO GERINT), Bibliothek #14 (&quot;HTML&quot;)</b>
<p>
Es gibt andere Stellen in CompuServe und in anderen Online-Diensten, etwa America Online, an denen das Dokument downloadbar ist. Der Autor kann Ihnen dazu jedoch weder Auskunft dar&uuml;ber geben, wo genau das Dokument verf&uuml;gbar ist, noch ob es sich um die aktuelle Version handelt.
<p>
Zum Entpacken der ZIP-Datei ben&ouml;tigen Sie ein Unzip-Programm. Wenn Sie mit MS Windows arbeiten, ist dazu das Programm <img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.winzip.com/"><b>WinZip</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0> empfehlenswert. Das ZIP-Format ist mittlerweile der Standard f&uuml;r gepackte Download-Dateien. Es gibt f&uuml;r praktisch alle Betriebssysteme Entpacker daf&uuml;r. Informieren Sie sich evtl. beim Software-Hersteller Ihres Betriebssystems.


<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a8"><h2><font color=#6666CC>Verwendeter HTML-Standard</font></h2></a>
Diese Version von &quot;HTML-Dateien selbst erstellen&quot; verwendet den HTML-Standard 3.2 zur Darstellung. Dazu geh&ouml;ren Tabellen, farbige Schriftarten, definierter Hintergrund usw. Wenn Ihr WWW-Browser dieses Dokument v&ouml;lllig fehlerhaft anzeigt, entspricht der Browser nicht mehr dem derzeitigen Standard. Bitte haben Sie Verst&auml;ndnis daf&uuml;r, da&szlig; auch ein &quot;wichtiges&quot; Dokument wie dieses nicht bis in alle Ewigkeit r&uuml;ckw&auml;rtskompatibel zu den ersten Versionen von Mosaic oder Cello bleiben mag. 
<p>
Ferner wird in diesem Dokument ein HTML-Tag benutzt, das derzeit nur von Netscape ab Version 3.0 interpretiert wird. Es handelt sich dabei um einen Befehl zum Erzeugen gr&ouml;&szlig;erer Abst&auml;nde zu neuen Zwischen&uuml;berschriften. Dies hat jedoch keinen bedeutenden Einflu&szlig;, und das Dokument wird auch auf WWW-Browsern, die diesen Befehl nicht unterst&uuml;tzen, korrekt angezeigt.



<p><spacer type=vertical size=30>
<a name="a9"><h2><font color=#6666CC>Technische Bedingungen</font></h2></a>
Dieses Dokument wurde durchweg mit dem HTML-Editor <img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.dexnet.com/homesite.html"><b>HomeSite</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0> (Version 2.0/2.5) unter MS Windows 95 erstellt. Das Dokument wurde auf zwei PCs erstellt, einem Pentium 90/16 MB/2 MB Grafik/15&quot;-Monitor(800x600) und einem Pentium 166/64 MB/2 MB Grafik/17&quot;-Monitor(10242x768). F&uuml;r die Grafik kam ausschlie&szlig;lich <img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.jasc.com/psp.html"><b>Paintshop Pro</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0> (Version 3.12 und Version 4.0) zum Einsatz. Die Grafiken wurden vorwiegend selbst erstellt oder entstammen der Doppel-CD-ROM &quot;Masterclips 35.000&quot;, zu beziehen &uuml;ber den IMSI-Verlag, Bayerwaldstra&szlig;e 46, D-81737 M&uuml;nchen, Tel. (++49) 89-637-3357.


<p><spacer type=vertical size=30>
<a name="a10"><h2><font color=#6666CC>Risiken und Nebenwirkungen</font></h2></a>
Dieses Dokument hat in den bislang zwei Jahren seiner &ouml;ffentlichen Verf&uuml;gbarkeit etlichen Lebensl&auml;ufen eine neue Richtung gegeben. Manche Menschen haben &uuml;ber Nacht ihren bisherigen Job geschmissen und im Web-Publishing neues Heil gesucht. Sicher war es niemals nur dieses Dokument allein - eine entsprechende innere Bereitschaft war und bleibt stets die Voraussetzung f&uuml;r entscheidende berufliche oder pers&ouml;nliche Ver&auml;nderungen. Doch die &quot;Initialz&uuml;ndung&quot;, die dieses Dokument bei vielen Menschen ausgel&ouml;st hat, soll zumindest nicht verschwiegen werden - nicht aus Autoreneitelkeit, sondern als gutgemeinte Warnung an allzu sensible und labile Gem&uuml;ter: werden Sie Web-Designer oder Provider, wenn Sie wollen. Aber lassen Sie sich Zeit dazu, und lernen und probieren Sie erst mal genug, bevor Sie ahnungslose Kunden mit unversch&auml;mten Angeboten &uuml;ber den Tisch zu ziehen versuchen. Machen Sie das World Wide Web bitte nicht kaputt, nur weil Sie glauben, aus einem Dokument wie diesem ein Wissen ziehen zu k&ouml;nnen, mit dem Sie andere f&uuml;r dumm verkaufen k&ouml;nnen.



<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a11"><h2><font color=#6666CC>Spenden</font></h2></a>
Hin und wieder wird der Autor gefragt, ob es m&ouml;glich sei, eine Spende als Gegenleistung f&uuml;r die Arbeit, die hinter diesem Dokument steckt, zu &uuml;berweisen. Falls Sie einen Geldbetrag &uuml;berweisen wollen, tun Sie das auf folgendes Konto: <i>Stefan M&uuml;nz, Volksbank M&uuml;nchen, BLZ: 701 900 00, Kontonr.: 63177</i>.
<p>
Beachten Sie jedoch, da&szlig; der Autor unabh&auml;ngig bleiben und keinerlei Verpflichtungen eingehen will, egal welchen Betrag Sie &uuml;berweisen.  



<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<table>
<tr><td></td><td colspan=2 align=center><font size=-1>Bl&auml;ttern:</font></td><td></td></tr>
<tr>
<td></td>
<td></td>
<td align=right><img  src="xgnext.gif" width=10 height=10 border=0>&nbsp;<img  src="x3.gif" width=15 height=10 border=0></td>
<td><a href="tab.htm"><b>Hinweise zum Arbeiten mit diesem Dokument</b></a></td>
</tr>
</table>
<p>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="ta.htm"><b>Editorial</b></a></td>
</tr>
</table>
<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>

