<html>
<head>
<title>SELFHTML: ActiveX: Microsoft-Programm-Module f&uuml;r das WWW</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tb.htm"><b>Einf&uuml;hrung</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tbb.htm"><b>Erg&auml;nzungen und Alternativen zu HTML</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC>ActiveX: Microsoft-Programm-Module f&uuml;r das WWW</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Allgemeines zu ActiveX</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Informationen und Beispiele zu ActiveX im WWW</b></a>
<p>
<hr noshade  size=1 width=50% align=left color=#6666CC>


<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC>Allgemeines zu ActiveX</font></h2></a>

ActiveX ist eine von Microsoft eingef&uuml;hrte Technologie f&uuml;r ausf&uuml;hrbaren Programmcode auf WWW-Seiten und dem Anspruch nach eine Alternative oder Konkurrenz zu <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tbbb.htm"><b>Java</b></a>. ActiveX ist dabei ein &Uuml;berbegriff f&uuml;r verschiedene Software-Komponenten. Alle diese Komponenten basieren auf dem sogenannten Component Object Model (COM). ActiveX ist jedoch kein Internet-Standard im herk&ouml;mmlichen Sinn, sondern der Versuch, spezifische Eigenschaften des MS-Windows-Betriebssystems f&uuml;r WWW-Seiten nutzbar zu machen. So ist es mit Hilfe von ActiveX beispielsweise m&ouml;glich, Eingaben aus HTML-Formularen einer WWW-Seite &uuml;ber die OLE-Schnittstelle von Windows direkt in eine Excel-Tabelle oder eine Access-Datenbank einzulesen (oder umgekehrt). Microsoft bem&uuml;ht sich zwar um L&ouml;sungen, die sich auch auf Macintosh- und Unix-Rechner &uuml;bertragen lassen. Doch letztendlich ist ActiveX f&uuml;r MS-Windows optimiert, und das mit Absicht.
<p>
Ein wesentlicher Bestandteil von ActiveX sind die sogenannten ActiveX-Controls. Solche Controls sind Programme oder Programm-Module, die sich in HTML-Dateien einbinden lassen, &auml;hnlich wie Java-Applets. Der Programmcode wird im Arbeitsspeicher des Client-Rechners (also des Anwenders, der eine WWW-Seite aufruft) ausgef&uuml;hrt. Normalerweise wird dabei auch eine AcitveX-Layoutdatei auf dem Rechner des Anwenders (im Windows-Verzeichnis) installiert. Mit ActiveX-Controls lassen sich Animationen, Spiele, Dialoge usw. auf WWW-Seiten realisieren.
<p>
Es gibt keine festen Vorschriften daf&uuml;r, in welcher Programmiersprache ActiveX-Code geschrieben ist. Der Compiler mu&szlig; jedoch das Component Object Model unterst&uuml;tzen. Immer h&auml;ufiger kommt die &quot;Haussprache&quot; von Microsoft, VBScript, daf&uuml;r zur Anwendung. Auf den WWW-Seiten von Microsoft k&ouml;nnen Sie sich ein <img src="xgonline.gif"  width=14 height=10>&nbsp;<a href="http://www.microsoft.com/germany/download/"><b>ActiveX Layout Control Pad downloaden</b></a>&nbsp;<img src="xdeu.gif" width=16 height=10 border=0>, ebenso das Software Develpment Kit (SDK) f&uuml;r ActiveX. Das ActiveX Layout Control Pad erlaubt das Erstellen einfacher ActiveX-Controls ohne Programmierkenntnisse. F&uuml;r interessantere Anwendungen, die Algorithmen zur Verarbeitung brauchen, ben&ouml;tigen Sie jedoch entsprechende Programmierkenntnisse.
<p>
ActiveX wird derzeit nur vom MS Internet Explorer direkt ausgef&uuml;hrt. F&uuml;r Netscape gibt es ein ActiveX-Plugin zum Downloaden. Bei Netscape-Anwendern, die das Plugin installiert haben, sind ActiveX-Controls dann auch ausf&uuml;hrbar.
<p>
Diskutiert wird derzeit noch das Sicherheitskonzept von ActiveX. Wenn Sie als Anwender erlauben, da&szlig; ein ActiveX-Control auf Ihren Rechner geladen wird, kann dieses Programm auf dem Rechner so ziemlich tun und lassen was es will. Es gibt also keine Befehlsbeschr&auml;nkungen bei ActiveX, sondern nur eine &quot;Vertrauensbarriere&quot; (n&auml;mlich die Abfrage des WWW-Browsers, ob der Anwender mit der Ausf&uuml;hrung des Programms auf seinem Rechner einverstanden ist oder nicht). Dadurch ist mit ActiveX aus Programmierersicht zwar viel mehr realisierbar als mit Java-Applets, doch aus Anwendersicht sind AcitveX-Module tendenziell unsicherer als Java-Applets.

<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a2"><h2><font color=#6666CC>Informationen und Beispiele zu ActiveX im WWW</font></h2></a>

Demos und Information zu AcitveX im WWW finden Sie an folgenden Stellen:

<p>
<img src="xgonline.gif"  width=14 height=10>&nbsp;<a href="http://www.microsoft.com/germany/partner/activexdemos/einfuehrung.htm"><b>Einf&uuml;hrung in ActiveX mit Demos</b></a>&nbsp;<img src="xdeu.gif" width=16 height=10 border=0><br>
von Microsoft selbst
<p>
<img src="xgonline.gif"  width=14 height=10>&nbsp;<a href="http://www.microsoft.com/germany/internet/activex/default.htm"><b>Information zum ActiveX Development Kit</b></a>&nbsp;<img src="xdeu.gif" width=16 height=10 border=0><br>
von Microsoft selbst
<p>
<img src="xgonline.gif"  width=14 height=10>&nbsp;<a href="http://activex.irdu.nus.sg/"><b>ActiveX Technology Group</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0><br>
Active-Entwicklervereinigung in Singapur
<p>
<img src="xgonline.gif"  width=14 height=10>&nbsp;<a href="http://www.activex.com/"><b>ActiveX.Com</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0><br>
ActiveX-Infos und Controls zum Downloaden
<p>
<img src="xgonline.gif"  width=14 height=10>&nbsp;<a href="http://www.techweb.com/activexpress/"><b>ActiveXpress</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0><br>
Hilfe, Tools, Demos, Downloads
<p>


<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<table>
<tr><td></td><td colspan=2 align=center><font size=-1>Bl&auml;ttern:</font></td><td></td></tr>
<tr>
<td><a href="tbbc.htm"><b>VRML: dreidimensionale bewegliche Welten im WWW</b></a></td>
<td><img  src="x3.gif" width=15 height=10 border=0>&nbsp;<img  src="xgprev.gif" width=10 height=10 border=0></td>
<td align=right><img  src="xgnext.gif" width=10 height=10 border=0>&nbsp;<img  src="x3.gif" width=15 height=10 border=0></td>
<td><a href="tbbe.htm"><b>Postscript/PDF: eine Alternative zu HTML</b></a></td>
</tr>
</table>
<p>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tb.htm"><b>Einf&uuml;hrung</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tbb.htm"><b>Erg&auml;nzungen und Alternativen zu HTML</b></a></td>
</tr>
</table>
<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>







