<html>
<head>
<title>SELFHTML: Postscript/PDF: eine Alternative zu HTML</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tb.htm"><b>Einf&uuml;hrung</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tbb.htm"><b>Erg&auml;nzungen und Alternativen zu HTML</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC>Postscript/PDF: eine Alternative zu HTML</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Postscript und PDF</b></a><br>
<p>
<hr noshade  size=1 width=50% align=left color=#6666CC>


<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC>Postscript und PDF</font></h2></a>

HTML ist eine logische Beschreibungssprache. Designer, die aus der DTP- und Grafikbranche kommen und nun in den WWW-Markt dr&auml;ngen, tun sich schwer mit dem Sprachkonzept von HTML, das eigentlich f&uuml;r wissenschaftliche und EDV-orientierte Zwecke geschaffen wurde. Im kommerziellen Bereich, wo perfekt abgestimmte grafische Pr&auml;sentationen gefragt sind, k&ouml;nnte sich deshalb auch das Postscript-Format von Adobe neben HTML durchsetzen. Postscript ist eine physische Beschreibungssprache, die das millimetergenaue und freie Positionieren von Text und Grafik (einschlie&szlig;lich Vektorgrafik) unterst&uuml;tzt. Urspr&uuml;nglich als Druckerbeschreibungssprache entwickelt, gewinnt das Postscript-Format heute zunehmend Bedeutung als plattformunabh&auml;ngiges Dateiformat f&uuml;r Bildschirmpr&auml;sentationen. H&auml;ufig mu&szlig; es allerdings daf&uuml;r herhalten, da&szlig; Print-Dokumente einfach in elektronische Reader konvertiert werden, ohne R&uuml;cksicht auf die Eigenheiten einer Bildschirmpr&auml;sentation. Damit ist niemandem gedient, und die Vorteile gegen&uuml;ber HTML verwandeln sich dabei nur zu oft in Nachteile. Dazu gesellt sich ein Konflikt, den viele klassische Print-Designer mit dem Bildschirm als Pr&auml;sentationsfl&auml;che haben. Nicht umsonst hat sich das &quot;Screen-Design&quot; als eigenständige Disziplin entwickelt.
<p>
Das von Adobe entwickelte Dateiformat f&uuml;r plattformunabh&auml;ngigen Postscript-Pr&auml;sentationen hei&szlig;t PDF (Portable Document Format). Zum Lesen von PDF-Dateien gibt es Viewer-Software. Im WWW k&ouml;nnen Sie z.B. den <img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.adobe.com/prodindex/acrobat/readstep.html"><b>Acrobat Reader downloaden</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0>.     
<p>
Speziell f&uuml;r die Erfordernisse des World Wide Web gibt es von Adobe ein Plug-In, das das PDF-Format voll hypertext-f&auml;hig macht. Das Plug-In hei&szlig;t <b>WebLink</b>. Auch World-Wide-Web-Verweise sind damit realisierbar. Autoren von PDF-Dateien erlaubt WebLink, Verweise mit WWW-Adressen in ihre Dokumente einzubinden. Wenn Sie als Anwender den Acrobat Reader benutzen und WebLink installiert haben, k&ouml;nnen Sie in PDF-Dateien, die WWW-Verweise enthalten, wie im WWW-Browser auf diese Verweise klicken. Ist die Internet-Verbindung hergestellt, wird die betreffende WWW-Seite aufgerufen. Wenn das Verweisziel wiederum eine PDF-Datei ist, wird sie in den Viewer geladen. Wenn es eine HTML-Datei ist, wird ein installierter WWW-Browser (derzeit nur Netscape ab Version 2.0 oder Spyglass Enhanced Mosaic) aufgerufen. Sie k&ouml;nnen das WebLink Plug-In downloaden. Rufen Sie dazu den <img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.adobe.com/misc/search.html"><b>Suchdienst von Adobe</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0> auf und suchen Sie nach <i>WebLink</i>.
<p>
Um eigene PDF-Dokumente zu erstellen, brauchen Sie die Entwickler-Software von Adobe. Diese Software besteht aus den kostenpflichtigen Komponenten <img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.adobe.com/prodindex/acrobat/"><b>Adobe Acrobat</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0>. Wenn Sie dieses Software-Paket besitzen, k&ouml;nnen Sie z.B. vorhandene, mit Winword, Excel, Corel Draw, PageMaker und anderen Programmen erstellte Daten &uuml;ber die Postscript-Schnittstelle v&ouml;llig verlustfrei in das PDF-Format konvertieren und nachbearbeiten (z.B., um Hypertext-Verweise einzubauen). 






<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<table>
<tr><td></td><td colspan=2 align=center><font size=-1>Bl&auml;ttern:</font></td><td></td></tr>
<tr>
<td><a href="tbbd.htm"><b>ActiveX: Microsoft-Programm-Module f&uuml;r das WWW</b></a></td>
<td><img  src="x3.gif" width=15 height=10 border=0>&nbsp;<img  src="xgprev.gif" width=10 height=10 border=0></td>
<td align=right><img  src="xgnext.gif" width=10 height=10 border=0>&nbsp;<img  src="x3.gif" width=15 height=10 border=0></td>
<td><a href="tbbf.htm"><b>Plugins: beliebige Dateiformate unter einem Dach</b></a></td>
</tr>
</table>
<p>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tb.htm"><b>Einf&uuml;hrung</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tbb.htm"><b>Erg&auml;nzungen und Alternativen zu HTML</b></a></td>
</tr>
</table>
<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>







