<html>
<head>
<title>SELFHTML: Die Zukunft von Internet, WWW und HTML</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tb.htm"><b>Einf&uuml;hrung</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tbc.htm"><b>Perspektiven f&uuml;r HTML und Web-Designer</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC>Die Zukunft von Internet, WWW und HTML</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Internet-Boom und Internet-Zukunft</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Dynamische und interaktive Erweiterungen im WWW</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>HTML als universelle Computer-Oberfl&auml;che</b></a><br>
<p>
<hr noshade  size=1 width=50% align=left color=#6666CC>


<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC>Internet-Boom und Internet-Zukunft</font></h2></a>

Die Geschichte des Internet beginnt Ende der 60er Jahre in den USA. Seit Mitte der 70er Jahre hei&szlig;t das Internet &quot;Internet&quot;. Die dahinterstehende Idee ist milit&auml;rischer Natur. Die Vereinigten Staaten von Amerika wollten in der Atmosph&auml;re des Kalten Krieges ein Datennetz installieren, dessen Hauptmerkmal die Dezentralisierung der Information sein sollte. Das sollte f&uuml;r den Fall, da&szlig; der gro&szlig;e Gegner aus dem Osten atomare Anschl&auml;ge auf die USA ver&uuml;ben sollte, den Informationsflu&szlig; sicherstellen. 
<p>
Heute behaupten schadenfrohe Kritiker, da&szlig; sich die &quot;Supermacht&quot; damit wie einst die literarische Figur des Zauberlehrlings einen Geist erschaffen habe, den sie nicht mehr los wird. Tats&auml;chlich sorgt die Dezentralisierung von Daten im Internet heute f&uuml;r das faktische Au&szlig;erkrafttreten vieler Gesetze. Verfassungswidrige Daten stehen auf ausl&auml;ndischen WWW-Servern, und wenn der Verfassungsschutz dort eine Sperrung durchsetzt, erscheinen sie zur Strafe hundertfach auf anderen Server-Rechnern. Chinesische, serbische oder fundamentalistisch-islamische Machtorgane m&uuml;ssen mit ansehen, wie ihre Untertanen, sobald ein Internet-Zugang vorhanden ist, die Vielfalt der Welt kennenlernen statt die verordnete Ideologie. HTML-Dateien k&ouml;nnen strukturierten Text, Grafik und Multimedia transportieren, so da&szlig; die Inhalte immer einen Weg zum Verst&auml;ndlichmachen finden. Und eine HTML-Datei kann man nicht erschie&szlig;en. Deshalb ist die Rolle von HTML bei alledem nicht zu untersch&auml;tzen.
<p>
Andererseits hat der Internet-Boom der letzten Jahre die gesamte Gesch&auml;ftswelt erfa&szlig;t, auch das Big Business. Firmen wie Netscape erlebten B&ouml;rsen-Traumstarts. Vertriebsleute, die faktisch keine Ahnung vom Internet haben, reden B&auml;nde dar&uuml;ber, unterst&uuml;tzt durch schicke Overhead-Folien. Keine namhafte Firma kann es sich mehr leisten, nicht im Internet vertreten zu sein, auch wenn viele Firmen offensichtlich nicht so recht wissen, was sie mit ihrer WWW-Pr&auml;senz eigentlich anfangen sollen.
<p>
Eines kann man getrost feststellen: im Internet trifft die Intelligenz von heute aufeinander, egal ob Freaks, Sucher nach neuen Kulturformen, Wissenschaftler oder innovative Gesch&auml;ftsleute. Kulturverwalter der alten Schule, die f&uuml;r das neue Medium nur Verachtung &uuml;brig haben, werden von den nachwachsenden Generationen gr&uuml;ndlich ignoriert und geraten ins Abseits. Wer sich dem neuen Medium nicht stellt, versteht den Fortgang der Geschichte nicht mehr. Die Abl&ouml;sung findet derzeit statt. 
<p>
Der Internet-Boom hat allerdings auch die sogenannte &quot;Netiquette&quot;, das ungeschriebene Gesetz der weltweit g&uuml;ltigen Umgangsformen im Internet, stark in Mitleidenschaft gezogen. Allzuviele &quot;Jetzt-Komm-Ich&quot;-Strategen, aber auch viele Kids, die ihre soziale Bindungslosigkeit mit Agressionen in den weiten Kommunikationsr&auml;umen des Netzes r&auml;chen, sorgen derzeit f&uuml;r ein Einfrieren der ehemals vorherrschenden, uneigenn&uuml;tzigen Geber-Mentalit&auml;t. Als Reaktion darauf bilden sich Nischen. Auf einzelnen WWW-Adressen, in ausgesuchten Newsgroups, Mailing-Listen und in einzelnen Foren von Online-Diensten konzentriert sich das intellektuelle Geschehen, w&auml;hrend der Rest des Netzes der seichten, vom &quot;Zappen&quot; kaum unterscheidbaren Surferei &uuml;berlassen wird.
<p>
Auch wenn derzeit viel von virtuellen, unendlichen R&auml;umen und dergleichen die Rede ist: das Internet wird von Menschen &quot;gemacht&quot;, und Menschen haben Bed&uuml;rfnisse wie Geborgenheit, Zugeh&ouml;rigkeit, Identifikation. Die heute oft &uuml;bliche, kalt-metallische Cyberspace-Symbologie mu&szlig; menschlicheren Vorstellungen weichen. In den USA nutzen viele B&uuml;rger das Internet schon l&auml;ngst nur noch auf lokaler Ebene. Es ist ein gutes Gef&uuml;hl, sich in einem Anfall von Fremdheitssucht mal die Homepage einer neuseel&auml;ndischen Provinzschule anschauen zu k&ouml;nnen. Doch das wird in Zukunft nur ein angenehmer Nebeneffekt, nicht der Sinn des Netzes sein. Der Sinn des Netzes kann nicht darin bestehen, tradiertes Wissen und lebendige Kommunikationszusammenh&auml;nge zu zerst&ouml;ren, sondern sie in neuen, der Gegenwart gem&auml;&szlig;en Formen widerzuspiegeln. Die Tendenz zur Vernetzung wird dabei aber hoffentlich die Anzahl der erfreulichen &quot;Synergie-Effekte&quot; weltweit um ein Vielfaches erh&ouml;hen.


<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a2"><h2><font color=#6666CC>Dynamische und interaktive Erweiterungen im WWW</font></h2></a>

Das WWW von heute ist zu statisch. Text und Grafik dienen der Informationsvermittlung, bieten aber keine M&ouml;glichkeit zu echter Interaktion zwischen Menschen. Zwar bietet das Internet all diese M&ouml;glichkeiten an, z.B. Live-Kommunikation &uuml;ber Internet Relay Chat oder &ouml;ffentlichen Nachrichtenaustausch &uuml;ber Newsgroups, doch unbedarfteren Anwendern sind diese Dienste bislang kaum zug&auml;nglich, weil sie oft eigene Software und eine Menge zus&auml;tzliches Wissen erfordern.
<p>
Das heute absehbare Ziel ist, Live-Kommunikation und &ouml;ffentlichen Nachrichtenaustausch nahtlos ins WWW bzw. in die WWW-Browser-Software zu integrieren. Denn Hypertext ist nicht nur elektronisch vernetzter &quot;druckreifer&quot; Text, sondern auch vernetzter &quot;schnellebiger&quot; Text. Die heute noch so strenge Trennung zwischen WWW, Newsgroups und Internet Relay Chat wird aus Anwendersicht verschwinden. Unmittelbar oder kurzfristig relevante Texte und langfristig relevante Texte werden viel enger vernetzt. 
<p>
<img src="xtbca.gif" width=268 height=268 border=0 alt="Netscape Message-Fenster" align=left hspace=10>Netscape baut die Bereiche Live-Kommunikation und &ouml;ffentlicher Nachrichtenaustausch in seiner neuen Version 4.0 aus. Dabei wird HTML als Default-Format f&uuml;r E-Mail und Newsgroup-Beitr&auml;ge eingesetzt. HTML-formatierte Nachrichten k&ouml;nnen z.B. anklickbare Verweise und Grafikreferenzen enthalten. Die HTML-Formatierung geschieht dabei im Hintergrund, d.h. unterhalb einer grafischen Oberfl&auml;che, die keine HTML-Kenntnisse erfordert. HTML-formatierte Nachrichten enthalten zwar mehr Zeichen, erh&ouml;hen die Netzbelastung und sind ein &Auml;rger f&uuml;r Anwender, die noch keinen HTML-f&auml;higes E-Mail-Programm benutzen, aber aufzuhalten sind sie wohl nicht. 
<p>
Text und einfache Grafik werden auch in Zukunft die Basis des WWW bilden. Die meisten Internet-Adressen werden nach wie vor statische HTML-Dateien sein, Homepages mit vernetzter Information. Doch die WWW-Projekte der Zukunft werden mehr interaktive Elemente enthalten, die weit &uuml;ber heutige &quot;G&auml;steb&uuml;cher&quot; oder Email-Verweise hinausgehen. WWW-Projekte der Zukunft werden alles enthalten, was heute Online-Dienste wie CompuServe oder America Online bieten: Information, Download-M&ouml;glichkeiten, Live-Kommunikation (&quot;Chatten&quot;) und &ouml;ffentlichen Nachrichtenaustausch. Homepages werden dadurch zu Foren, Treffpunkten und Konferenzr&auml;umen, die nicht nur von der Aufmachung der statischen WWW-Seiten leben, sondern auch von der Pr&auml;senz und der kommunikativen Lebendigkeit des Anbieters.
<p>
Die gro&szlig;en Online-Dienste werden sich ihrerseits vollst&auml;ndig ins Internet integrieren und sich von anderen WWW-Anbietern nur noch durch die F&uuml;lle der angebotenen Information und Kommunikation unterscheiden, auch durch &quot;Firewalls&quot; (reservierte Bereiche f&uuml;r Mitglieder), aber nicht mehr durch eine exklusive Oberfl&auml;che. Alle lesbaren Informationen werden auch bei diesen Online-Diensten auf HTML basieren.
<br clear=all>


<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a3"><h2><font color=#6666CC>HTML als universelle Computer-Oberfl&auml;che</font></h2></a>

Microsoft macht kein Geheimnis mehr daraus, da&szlig; es Windows und Internet verschmelzen will. Viele Kritiker sind deshalb besorgt bis erbost, weil sie bef&uuml;rchten, da&szlig; dies nichts anderes sei als der Versuch, aus dem Internet eine Art erweitertes Windows-Vezeichnis zu machen, mitsamt der zugeh&ouml;rigen Lizenz-Abzockerei. Zun&auml;chst einmal wird die Verschmelzung allerdings so aussehen, da&szlig; die n&auml;chste Generation der PC-Benutzeroberfl&auml;chen das erfolgreiche Konzept des Hypertextings und Browsings aufgreift. Wenn es gelingt, Benutzeroberfl&auml;che und Betriebssystemkern vollst&auml;ndig zu entkopppeln und nur &uuml;ber eine definierte Befehlsschnittstelle (vergleichbar CGI) miteinander kommunizieren zu lassen, spricht nichts dagegen, HTML als Beschreibungssprache f&uuml;r Navigation und Dialogsituationen der Benutzeroberfl&auml;che einzusetzen. Mit Listen, Verweisen und Formularen enth&auml;lt die Sprache alle dazu notwendigen Eigenschaften. Computer-Desktop und Dialogbereiche von Anwendungen w&uuml;rden sich dann nicht mehr von Web-Seiten unterscheiden. Wenn es schlie&szlig;lich sogar noch gelingen sollte, die Befehlsschnittstelle zwischen Benutzeroberfl&auml;che und Betriebssystemkern als plattform&uuml;bergreifenden Standard zu definieren, k&ouml;nnte jeder Benutzer seine eigene Oberfl&auml;che gestalten und diese Oberfl&auml;che auf verschiedenen Betriebssystemen benutzen. Bei den Betriebssystemen w&uuml;rde sich dann das sicherste, schnellste und ressourcen-freundlichste durchsetzen - weil es sonst keine Vergleichskriterien mehr daf&uuml;r g&auml;be.
<p>
Wer wei&szlig; - vielleicht schafft Microsoft mit seiner Strategie wie einst die Milit&auml;rstrategen des Pentagon einen Geist, der nicht mehr loszuwerden ist.









<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<table>
<tr><td></td><td colspan=2 align=center><font size=-1>Bl&auml;ttern:</font></td><td></td></tr>
<tr>
<td><a href="tbbf.htm"><b>Plugins: beliebige Dateiformate unter einem Dach</b></a></td>
<td><img  src="x3.gif" width=15 height=10 border=0>&nbsp;<img  src="xgprev.gif" width=10 height=10 border=0></td>
<td align=right><img  src="xgnext.gif" width=10 height=10 border=0>&nbsp;<img  src="x3.gif" width=15 height=10 border=0></td>
<td><a href="tbcb.htm"><b>Intranets</b></a></td>
</tr>
</table>
<p>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tb.htm"><b>Einf&uuml;hrung</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tbc.htm"><b>Perspektiven f&uuml;r HTML und Web-Designer</b></a></td>
</tr>
</table>
<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>







