<html>
<head>
<title>SELFHTML: Intranets</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tb.htm"><b>Einf&uuml;hrung</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tbc.htm"><b>Perspektiven f&uuml;r HTML und Web-Designer</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC>Intranets</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Intranets- interne Netze mit Internet-Technologie</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Kriterien f&uuml;r erfolgreiche Intranets</b></a>
<p>
<hr noshade  size=1 width=50% align=left color=#6666CC>


<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC>Intranets- interne Netze mit Internet-Technik</font></h2></a>

Intranets sind nicht-&ouml;ffentliche Datennetze von Firmen oder gro&szlig;en Organisationen. Es kann sich um LAN-Netze (LAN = Local Area Network) oder WAN-Netze (WAN = Wide Area Network) handeln, oft auch um Mischformen. Intranets werden innerhalb gro&szlig;er Firmen und Organisationen immer wichtiger f&uuml;r den Informationsaustausch und den Workflow zwischen einzelnen Unternehmensbereichen, Abteilungen und Tochtergesellschaften, da diese immer h&auml;ufiger geografisch weit voneinander getrennt agieren. Intranets haben die Aufgabe, Information netzweit oder gezielt f&uuml;r bestimmte Netzanwender bzw. Netzanwendergruppen innerhalb des Intranets zur Verf&uuml;gung zu stellen. Sie dienen dem schnellen schriftlichen Kommunikationsaustausch, dem internen Datenaustausch und dem gemeinsamen Bearbeiten von Dokumenten.
<p>
Auch in solchen Netzen setzen sich technische Standards aus dem Internet immer st&auml;rker durch. Server-Rechner haben IP-Adressen, TCP/IP wird als Tr&auml;gerprotokoll eingesetzt, HTTP als High-Level-Protokoll und HTML als Dokumentbeschreibungsformat - genau wie im World Wide Web. Mit Standard-WWW-Browsern k&ouml;nnen die Mitarbeiter in solchen Netzen ebenso wie im WWW navigieren.
<p>


<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a2"><h2><font color=#6666CC>Kriterien f&uuml;r erfolgreiche Intranets</font></h2></a>

Intranets stellen f&uuml;r den Betreiber, also die Firma selbst, eine Kostenbelastung dar, die sich nicht unmittelbar in me&szlig;baren Gewinn umsetzen l&auml;&szlig;t. Deshalb stehen Intranets unter dem Druck, zumindest den Informationsflu&szlig; me&szlig;bar zu erh&ouml;hen und andere logistische Kosten me&szlig;bar einzusparen. Das kann nur gelingen, wenn in so einem Intranet alle ben&ouml;tigten Daten zur Verf&uuml;gung stehen, die Daten leicht auffindbar sind und stets aktuell gehalten werden. Dazu m&uuml;ssen sich gen&uuml;gend Mitarbeiter das dazu n&ouml;tige Know How aneignen. Es m&uuml;ssen Software-Entscheidungen getroffen werden, interne Schulungen stattfinden, und Standards f&uuml;r ein m&ouml;glichst effizientes &quot;Authoring&quot; geschaffen werden.
<p>
Wichtige Kriterien daf&uuml;r sind:
<ul>
<li><b>Gemeinsame Autorenwerkzeuge</b><br>
Das wird in den wenigsten F&auml;llen nur ein einziges Programm sein. Meistens liegen Daten, die im Intranet publiziert werden sollen, ja schon in anderen Dateiformaten vor und m&uuml;ssen konvertiert werden. In einigen F&auml;llen wird es sogar w&uuml;nschenswert sein, sowohl eine HTML- als auch eine DTP/Print-Version von Dokumenten zu pflegen. Entscheidend ist, da&szlig; alle Mitarbeiter die gleichen Editoren, Konverter, Textverarbeitungssysteme, Makros usw. einsetzen. Es hat keinen Sinn, wenn einzelne Mitarbeiter ihre heimliche Web-Designer-Leidenschaft ausleben und die anderen nicht wissen, wie man solche Intranet-Seiten &uuml;berhaupt erstellt und hochl&auml;dt.
<p>
<li><b>Zentrale Anlaufstelle (Webmaster)</b><br>
Es mu&szlig; eine Stelle geben, an der die F&auml;den eines Intranets zusammenlaufen. Diese Stelle mu&szlig; vorgeben, wie die grunds&auml;tzliche Verzeichnisstruktur auszusehen hat, welche Layout- und Corporate-Identity-Richtlinien beachtet werden sollten, welche Elemente jede Intranet-Seite haben sollte (z.B. einen anklickbaren E-Mail-Verweis der inhaltsverantwortlichen Person, Erstelldatum und Version am Seitenende). Sie mu&szlig; den Inhalt des Netzes kontrollieren, Mi&szlig;st&auml;nde (z.B. Datenleichen) erkennen und entsprechend reagieren. 
<p>
<li><b>Inhaltliche und zeitliche Richtlinien</b><br>
Es m&uuml;ssen abteilungs&uuml;bergreifende Standards daf&uuml;r gefunden werden, welche Art von Daten obligatorisch im Intranet zur Verf&uuml;gung gestellt werden m&uuml;ssen, welche fakultativ zur Verf&uuml;gung gestellt werden k&ouml;nnen, und welche nicht publiziert werden d&uuml;rfen. Es sollte Richtlinien daf&uuml;r geben, in welchen Zeitabst&auml;nden bei aktuell zu haltenden Daten Updates erfolgen m&uuml;ssen. Denn es hat wenig Sinn, wenn eine einzelne Abteilung von Computer-Freaks ihren gesamten Schriftverkehr und alle Bespechungsprotokolle publiziert, w&auml;hrend andere Abteilungen zu faul sind, auch nur eine Einstiegsseite ins Netz zu stellen.
<p>
<li><b>Dokumentation und Verf&uuml;gbarkeit von Intranet-KnowHow</b><br>
Autorenwerkzeuge sollten downloadbar sein. Richtlinien, Vorgehensweisen usw. m&uuml;ssen im Intranet selbst so dokumentiert sein, da&szlig; Mitarbeiter in der Lage sind, sich selbst&auml;ndig mit dem Publizieren im Intranet vertraut zu machen. F&uuml;r downloadbare Arbeitsmittel und Dokumentation sollte es einen eigenen Bereich im Intranet geben. Falls Sie das vorliegende Dokument f&uuml;r eine hilfreiche Informationsquelle halten, d&uuml;rfen Sie das Dokument selbstverst&auml;ndlich in Ihrem Intranet zur Verf&uuml;gung stellen - solange das Dokument in unver&auml;nderter Form publiziert wird.


</ul>



<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<table>
<tr><td></td><td colspan=2 align=center><font size=-1>Bl&auml;ttern:</font></td><td></td></tr>
<tr>
<td><a href="tbca.htm"><b>Die Zukunft von Internet, WWW und HTML</b></a></td>
<td><img  src="x3.gif" width=15 height=10 border=0>&nbsp;<img  src="xgprev.gif" width=10 height=10 border=0></td>
<td align=right><img  src="xgnext.gif" width=10 height=10 border=0>&nbsp;<img  src="x3.gif" width=15 height=10 border=0></td>
<td><a href="tbcc.htm"><b>Berufsbild Web-Designer</b></a></td>
</tr>
</table>
<p>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tb.htm"><b>Einf&uuml;hrung</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tbc.htm"><b>Perspektiven f&uuml;r HTML und Web-Designer</b></a></td>
</tr>
</table>
<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>







