<html>
<head>
<title>SELFHTML: Anzeigebeispiel: Farbe f&uuml;r Text und Verweise</title>
</head>
<body bgcolor=#FFFFFF text=#990000 link=#009900 vlink=#006600 alink=#0000FF>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=4><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="tc.htm"><b>Dokumentation: HTML</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tcc.htm"><b>Dateiweite Farben und Hintergrund</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tcca.htm"><b>Hintergrundfarbe und Textvordergrundfarben</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<h2>Farbe f&uuml;r Text und Verweise</h2>
<img src="xshow.gif" width=33 height=14 border=0 alt="Beschreibung"><br>
<a href="tcca.htm#a2"><b>Beschreibung: so wird's gemacht</b></a>
<p>
<FONT FACE="Wide Latin" SIZE=+2>I</FONT>n einem Schnell-Imbi&szlig;, wo man H&auml;hnchen verzehren konnte, stand
ich unschl&uuml;ssig herum und wu&szlig;te nicht, ob ich ein H&auml;hnchen essen
sollte oder nicht. Da kam sie herein, ein junges M&auml;dchen, etwas
kr&auml;ftig, aber wohlgebaut, nackenlange Haare, dunkle Augen. Keine
ausgesprochene Sch&ouml;nheit, aber mein Blick blieb wie gefesselt an
ihr h&auml;ngen. Als sie bemerkte, da&szlig; ein Blick ihr &uuml;berall hin
folgte, schaute sie zu mir hin. Kein L&auml;cheln, aber auch kein
Abweisen. Wir schauten uns noch &ouml;fters an. Ein
H&auml;hnchen habe ich nicht mehr gegessen.
<P>
<FONT FACE="Wide Latin" SIZE=+2>I</FONT>ch konnte sie nicht vergessen. Und tats&auml;chlich, wenige Tage
sp&auml;ter sah ich sie wieder, vor einem m&auml;chtigen Bauwerk aus der
Gr&uuml;nderzeit, der Universit&auml;t, an der ich studierte, auf der
anderen Stra&szlig;enseite, an einer Bushaltestelle. Sie schien auch
zu studieren. Als sie mich diesmal erblickte, l&auml;chtelte sie
gleich. Ich l&auml;chelte zur&uuml;ck. Das M&auml;dchen nahm mich vollkommen
gefangen. Doch pl&ouml;tzlich sah ich in ihren Augen etwas, das mich
erschaudern lie&szlig;. Ich glaubte zu erkennen, da&szlig; sie in
Wirklichkeit ein junger Mann war, nur eben sehr weiblich.
&Uuml;berst&uuml;rzt wandte ich mich ab und rannte in das m&auml;chtige Geb&auml;ude
der Universit&auml;t.
<P>
<FONT FACE="Wide Latin" SIZE=+2>I</FONT>ch ahnte, da&szlig; sie mir folgen w&uuml;rde. Im Menschenget&uuml;mmel des
riesigen Treppenhauses hielt ich mich so gut es ging versteckt.
Da entdeckte ich sie. Aufgeregt rannte sie herum, Tr&auml;nen in den
Augen, mit fieberhaft suchendem Blick. So sehr ich bereits in
sie verliebt war, kam ich doch nicht mehr von dem Eindruck los,
sie sei in Wirklichkeit ein Mann. Ich blieb in meinem Versteck,
bis sie endg&uuml;ltig in der falschen Richtung weitersuchte.
<P>
<FONT FACE="Wide Latin" SIZE=+2>W</FONT>ochen oder Monate sp&auml;ter hatte ich herausbekommen, da&szlig; sie
nat&uuml;rlich nur ein junges M&auml;dchen und kein verkappter junger Mann
war. Die Gef&uuml;hle f&uuml;r sie zehrten mich auf. Ich hatte sie seitdem
nicht mehr gesehen.  Eines Tages dann, abermals in dem riesigen
Treppenhaus, hinter irdendeinem Info-Stand, sah ich sie wieder.
Z&ouml;gernd ging ich auf sie zu. Als sie mich erblickte, lachte sie
nur ganz kurz kopfsch&uuml;ttelnd in sich hinein und ignorierte mich.
Dann sah ich, wie sie jemanden innig umarmte.
<P>
<FONT FACE="Wide Latin" SIZE=+2>G</FONT>ut, da&szlig; ich in diesem Moment erwachte und verdutzt in die 
Dunkelheit des Schlafzimmers blickte.

<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>
