<html>
<head>
<title>SELFHTML: Anzeigebeispiele: Farbige Tabellen</title>
</head>
<body bgcolor=#FFFFFF background="xback02.gif" text=#000000 link=#CC6633 vlink=#993300 alink=#0000CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=4><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="tc.htm"><b>Dokumentation: HTML</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tce.htm"><b>Tabellen</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tcef.htm"><b>Farbige Tabellen</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC>Anzeigebeispiel: Farbige Tabellen</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC><img src="xmsie3.gif" width=30 height=30 border=0 alt="MS IE3.0"> Hintergrundbild (Wallpaper) f&uuml;r Tabellen oder Tabellenzellen</font></h2></a>

<img src="xshow.gif" width=33 height=14 border=0 alt="Beschreibung"><br>
<a href="tcef.htm#a4"><b>Beschreibung: so wird's gemacht</b></a>
<p>
<table border background="xback01.jpg" cellpadding=4> 
      <tr>
        <th align=left>&#160;</th>
        <th align=left background="xback03.gif"><font color=#FFFFCC>Erde</font></th>
        <th align=left background="xback03.gif"><font color=#FFFFCC>Mars</font></th>
        <th align=left background="xback03.gif"><font color=#FFFFCC>Venus</font></th>
      </tr>
      <tr>
        <th align=left valign=top background="xback03.gif"><font color=#FFFFCC>Allgemeines</font></th>
        <td align=left valign=top>
W&auml;hrend der ersten rund 500 Millionen Jahre nach ihrer Entstehung blieb die Temperatur der Erde relativ stabil bei 875 Grad Celsius. Die Erde setzte sich vor allem aus Eisen und Silikaten zusammen,
enthielt aber auch kleine Mengen radioaktiver Elemente, und zwar haupts&auml;chlich Uran, Thorium und Kalium. Im Verlaufe des Zerfallsprozesses dieser Elemente entstand Strahlung, die die Erde langsam
erhitzte, was zur Folge hatte, da&szlig; das Eisen und die Silikate schmolzen. Das Eisen sank zum Zentrum ab und dr&auml;ngte dadurch die leichteren Silikate an die Oberfl&auml;che. Dadurch wurden die gewaltigen Prozesse in Gang gesetzt, die die Erdoberfl&auml;che so geformt haben, wie wir sie kennen und die sie auch heute noch pr&auml;gen.        
        </td>
        <td align=left valign=top>
Da der Planet Mars gut sichtbar und seine Atmosph&auml;re d&uuml;nn und transparent ist, wissen wir mehr &uuml;ber ihn als &uuml;ber alle anderen Planeten, die Erde ausgenommen. Ein Tag dauert auf Mars ungef&auml;hr so lange wie auf der Erde, da Mars 24 Stunden und 37 Minuten ben&ouml;tigt, um sich um seine eigene Achse zu drehen; sein Jahr jedoch dauert 687 Erdentage. Seine Entfernung von der Sonne kann infolge seiner exzentrischen Umlaufbahn um rund 60 Millionen Kilometer variieren.
        </td>
        <td align=left valign=top>
Die Venus, geheimnisumwobener und direkter Nachbar der Erde, wurde nach der gleichnamigen r&ouml;mischen Liebesg&ouml;ttin benannt. Aus ungekl&auml;rten Gr&uuml;nden dreht sich die Venus &quot;r&uuml;ckw&auml;rts&quot; um die eigene Achse, das hei&aacute;t in der ihrer Drehbewegung um die Sonne entgegengesetzten Richtung.
        </td>
      </tr>
      <tr>
        <th align=left valign=top background="xback03.gif"><font color=#FFFFCC>Atmosph&auml;re</font></th>
        <td align=left valign=top>
Zwischen dem Kern aus Eisen und der Kruste aus festem Gestein befindet sich ein Mantel aus schwerem Silikatgestein von etwa 2800 Metern Dicke. Der Mantel ist weder fest noch fl&uuml;ssig, sondern von einer z&auml;hfl&uuml;ssigen Konsistenz, auf der die Kruste schwimmt. Diese Kruste besteht nicht aus einem zusammenh&auml;ngenden St&uuml;ck fester Masse, sondern aus mehreren voneinander getrennten Platten, an deren Grenzen die geologischen Prozesse weiterhin auf die Erdoberfl&auml;che einwirken.
        </td>
        <td align=left valign=top>
Aufgrund seiner blutroten Farbe gaben die R&ouml;mer dem Planeten Mars den Namen ihres Kriegsgottes; die Farbe ist auf Eisenoxid (&quot;Rost&quot;) an der Oberfl&auml;che zur&uuml;ckzuf&uuml;hren. Kanal&auml;hnliche Formationen an der Oberfl&auml;che des Planeten haben Wissenschaftler lange hoffen lassen, Wasser zu finden, was h&auml;tte darauf hindeuten k&ouml;nnen, da&aacute; auf Mars Leben existiert.
        </td>
        <td align=left valign=top>
Die Venus ist tats&auml;chlich &quot;umwoben&quot; von einer geheimnisvollen, undurchdringlichen schweren Schicht von Wolken aus Schwefels&auml;ure &uuml;ber einer Atmosph&auml;re aus 96 Prozent Kohlendioxid.
        </td>
      </tr>
  </table>




<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=4><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="tc.htm"><b>Dokumentation: HTML</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tce.htm"><b>Tabellen</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tcef.htm"><b>Farbige Tabellen</b></a></td>
</tr>
</table>
</td>
</tr>
</table>

<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>

