<html>
<head>
<title>SELFHTML: Aufbau von Verweisen und Allgemeines</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tc.htm"><b>Dokumentation: HTML</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tcf.htm"><b>Verweise - projektintern und weltweit</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC><img src="xok.gif" width=30 height=30 border=0 alt="HTML2.0"> Aufbau von Verweisen und Allgemeines</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Schema f&uuml;r alle Verweise in HTML</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Allgemeines zu Verweisen</b></a>
<p>
<hr noshade  size=1 width=50% align=left color=#6666CC>
<p>

<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC> <img src="xok.gif" width=30 height=30 border=0 alt="HTML2.0"> Schema f&uuml;r alle Verweise in HTML</font></h2></a>
Alle Verweise in HTML haben einen einheitlichen Aufbau, egal ob sie zu einem Verweisziel in der gleichen Datei, zu einer anderen Datei im eigenen Projekt, zu einer beliebigen WWW-Adresse oder zu einer beliebigen Datei eines anderen Dateityps im Internet oder lokal auf dem eigenen Rechner f&uuml;hren.

<a name="ia_name"><h4><font color=#6666CC>Aufbau-Schema:</font></h4></a>
<table width=100% cellpadding=10><tr><td bgcolor=#FFFFCC>
<pre>
&lt;a href=&quot;[Verweisziel]&quot;&gt;Verweistext&lt;/a&gt;
</pre></td></tr></table><p>

<h4><font color=#6666CC>Erl&auml;uterung:</font></h4>
Das Setzen eines Verweises beginnt mit <b>&lt;a href=</b> (<i>a = anchor = Anker, href = hyper reference = Hyper(text)-Referenz</i>). Hinter dem Istgleichzeichen geben Sie das Verweisziel an. Das Verweisziel mu&szlig; in Anf&uuml;hrungszeichen stehen. Dahinter endet das einleitende Tag mit <b>&gt;</b>. Es folgt der Text, der dem Anwender als Verweis angeboten wird (bei den meisten WWW-Browsern andersfarbig, h&auml;ufig unterstrichen). Im Beispiel ist  das der Text &quot;Verweistext&quot;. Dahinter wird das abschlie&szlig;ende Tag <b>&lt;/a&gt;</b> notiert.
<p>
Das Verweisziel kann sein:
<ul>
<li>eine Stelle <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcfb.htm"><b>innerhalb der gleichen HTML-Datei</b></a>
<li>eine <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcfc.htm"><b>andere HTML-Datei im eigenen Projekt</b></a>
<li>eine beliebige <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcfd.htm"><b>WWW-Adresse</b></a>
<li>eine beliebige <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcfe.htm"><b>FTP-, Gopher-, Telnet-, oder Newsgroup-Adresse </b></a>
<li>eine beliebige <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcff.htm"><b>E-Mail-Adresse</b></a>
<li>eine beliebige <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcfg.htm"><b>Datei im Internet, auch eine Download-Datei</b></a>
<li>eine beliebige <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcfh.htm"><b>lokal abgelegte Datei</b></a>
</ul>

<h4><font color=#6666CC>Beachten Sie:</font></h4>
Zwischen <b>&lt;a href=...&gt;</b> und <b>&lt;/a&gt;</b> k&ouml;nnen Sie anstelle eines Verweistextes auch eine <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcgf.htm"><b>Grafik als Verweis</b></a> einbinden. 






<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a2"><h2><font color=#6666CC> <img src="xok.gif" width=30 height=30 border=0 alt="HTML2.0"> Allgemeines zu Verweisen</font></h2></a>

Verweise sind ein entscheidender Bestandteil jedes Hypertext-Projekts und der &quot;intelligente Mehrwert&quot; des World Wide Web. 
<p>
Mit Hilfe von Verweisen strukturieren Sie Ihr Projekt. Wenn Sie beispielsweise eine HTML-Datei mit einer Projekt-Einstiegsseite und verschiedene HTML-Dateien f&uuml;r Themenseiten planen, brauchen Sie in der Einstiegsseite Verweise zu allen Themenseiten und in jeder Themenseite einen R&uuml;cksprungverweis zur Einstiegsseite. Erst dadurch wird aus der losen Dateisammlung ein Hypertext-Projekt. In komplexeren Projekten wie dem vorliegenden Dokument finden Sie auch Verweise mit bestimmter Bedeutung - Verweise zu &uuml;bergeordneten oder untergeordneten Ebenen, Verweise zum Bl&auml;ttern, Verweise zum Wechseln zwischen Beschreibungen und Anzeigebeispielen, Querverweise, Verweise zu anderen WWW-Adressen usw. 
<p>
Alle Verweise in HTML haben den gleichen Aufbau (siehe oben). Das vereinfacht die Syntax, hat aber auch Nachteile: es gibt n&auml;mlich keine Verweise f&uuml;r bestimmte Aufgaben. Es ist Ihnen &uuml;berlassen, wie Sie zum Beispiel Verweise so gestalten, da&szlig; dem Anwender klar wird, ob es sich um einen R&uuml;ckverweis zur Einstiegsseite, um einen Querverweis zu einem assoziativ verwandten Thema, oder etwa um einen Verweis zu einer ganz anderen WWW-Adresse handelt.
<p>
<a name="test_1">Wichtig ist in allen F&auml;llen ein aussagekr&auml;ftiger Verweistext.<br>
<b>Schlecht</b> ist: <a href="#test_1">zur&uuml;ck</a> (wohin eigentlich?)<br>
<b>Gut</b> ist: <a href="#test_1">zur&uuml;ck zur Einstiegsseite</a> (ah ja!)
<p>
<a name="test_2">Verweise lenken die Aufmerksamkeit des Anwenders sofort auf sich. Wenn Sie Verweise mitten im Text notieren, sollten Sie als Verweistext inhaltlich beschreibende W&ouml;rter anbieten, keine W&ouml;rter ohne Inhalt<br>
<b>Schlecht</b> ist: F&uuml;r weitere Information klicken Sie <a href="#test_1">hier</a> (worum geht es &quot;hier&quot; eigentlich?)<br>
<b>Gut</b> ist: <a href="#test_1">Weitere Information</a> k&ouml;nnen Sie ebenfalls aufrufen (ah ja!)
<p>
Bei komplexeren Projekten sollten Sie sich &uuml;berlegen, wie Sie dem Anwender die Vielzahl der Verweise mit unterschiedlicher Bedeutung intuitiv zug&auml;nglich machen. Ein sinnvoller Weg ist, den Verweisen kleine Symbolgrafiken voranzustellen, so wie es im vorliegenden Dokument auch der Fall ist (siehe auch <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcga.htm"><b>Grafiken einbinden</b></a>). Durch aussagekr&auml;ftige Symbole k&ouml;nnen Sie dem Anwender sofort signalisieren, um welche Art von Verweis es sich handelt. Die Symbolgrafiken sollten jedoch in der H&ouml;he nicht gr&ouml;&szlig;er sein als normaler Flie&szlig;text - normalerweise etwa 10-12 Pixel. Auch <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcgf.htm"><b>Grafiken als Verweise</b></a> tragen h&auml;ufig zu einer besseren Verweiskennzeichnung bei.
<p>
Zu wenige Verweise erschweren das Navigieren in einem Projekt und zeugen von wenig Kreativit&auml;t beim Anbieter des Projekts. Zu viele Verweise verwirren den Anwender und k&ouml;nnen ein &quot;Lost-in-Hyperspace-Gef&uuml;hl&quot; erzeugen - auch das wirft kein gutes Licht auf den Projektanbieter. Setzen Sie deshalb alle Verweise, die zum bequemen Navigieren n&ouml;tig sind, und denken Sie auch an Querverweise sowie an sinnvolle Verweise zu anderen WWW-Adressen. &Uuml;bertreiben Sie die Querverweistechnik aber nicht.




<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<table>
<tr><td></td><td colspan=2 align=center><font size=-1>Bl&auml;ttern:</font></td><td></td></tr>
<tr>
<td><a href="tceh.htm"><b>Tips zum Umgang mit blinden Tabellen</b></a></td>
<td><img  src="x3.gif" width=15 height=10 border=0>&nbsp;<img  src="xgprev.gif" width=10 height=10 border=0></td>
<td align=right><img  src="xgnext.gif" width=10 height=10 border=0>&nbsp;<img  src="x3.gif" width=15 height=10 border=0></td>
<td><a href="tcfb.htm"><b>Projektverweise innerhalb einer HTML-Datei</b></a></td>
</tr>
</table>
<p>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tc.htm"><b>Dokumentation: HTML</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tcf.htm"><b>Verweise - projektintern und weltweit</b></a></td>
</tr>
</table>
<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>

