<html>
<head>
<title>SELFHTML: Anzeigebeispiel: Verweis zu Datei im gleichen Verzeichnis</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=5><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=4><a href="tc.htm"><b>Dokumentation: HTML</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="tcf.htm"><b>Verweise - projektintern und weltweit</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="tcfc.htm"><b>Projektverweise zu anderen HTML-Dateien</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tcfca.htm#a1"><b>Anzeigebeispiel: Verweis zu Datei im gleichen Verzeichnis</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC>Einfach eine andere Datei ;-)</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<h2><font color=#6666CC>Flaming</font></h2>

<table cellpadding=10>
<tr>
<td valign=top align=right bgcolor=#FFFFCC>
<h3><i>Diesen Artikel gibt's auch in: Pl@net, Ausgabe 1, November 1995</i></h3>
Der Ziff-Verlag stellte diesen Artikel seinerzeit freundlicherweise uns HTML-Freaks zur Verfügung, die ein elektronisches Magazin planten, aus dem dann aber doch nichts wurde...
<P>
<i>In diesem Artikel geht es nur um eines, um Verbalinjurien der sch&auml;rfsten Sorte. Im Cyberspace gibt es daf&uuml;r einen eigenen Namen und spezielle Foren: &quot;Flaming&quot; ist eine Kunst, die sich nicht jedermann erschlie&szlig;t.</i>

<p><font size=5 color=#66CC66><b><tt>
"HELLO? ANY BRAIN CELLS IN THAT EMPTY SPACE YOU CALL YOUR SKULL??"
</tt></b></font><p>
<font size=6 color=#FF6666><b><tt>
"You sad fuck. You dismal loser. You Yank - Gus"
</tt></b></font><p>
<font size=6 color=#66CC66><b><tt>
"Sorry Sir, but did you just reach the limit of your vocabulary?"
</tt></b></font><p>
<font size=4 color=#FF6666><b><tt>
"Wer bedient eigentlich Deinen Newsreader f&uuml;r Dich? Kann es sein, da&szlig; Du ein
Mitarbeiter der Telekom bist?"
</tt></b></font><p>
<font size=6 color=#66CC66><b><tt>
"Zum Trost: Man kann auch ohne einen Funken Intelligenz reich und ber&uuml;hmt werden."
</tt></b></font><p>
<font size=4 color=#FF6666><b><tt>
"Was willst du sabbernder Depp schon wieder hier??? Ich hatte eigentlich gehofft,
von deinen Idiotien wenigstens f&uuml;r kurze Zeit verschont zu bleiben !!!"
</tt></b></font><p>
<font size=5 color=#66CC66><b><tt>
"Still waiting for you to answer at least six different posts, chickenshit.
Gonna answer, or run?"
</tt></b></font><p>
<font size=6 color=#FF6666><b><tt>
"Warning: REALITY.SYS may be corrupt. Reboot universe (y/n)?"
</tt></b></font><p>
<img src="xclip03.gif" width=208 height=181 border=0>

<p>
</td>
<td>
&quot;Das Pferd fri&szlig;t keinen Gurkensalat.&quot; Mit diesem Satz soll DFÜ-Pionier Samuel
Morse seinen Telegraphen auf Funktionstauglichkeit gecheckt haben. Die ersten Worte,
die jemals von einem Modem &uuml;bertragen wurden, sind dagegen nicht &uuml;berliefert.
Datenhistoriker tippen jedoch auf &quot;Fri&szlig; Deinen bl&ouml;den Salat doch selber!&quot; oder
schlicht &quot;RTFM&quot; - Read the Fucking Manual, Du Idiot am anderen Ende der Leitung, und
la&szlig; mich damit in Ruhe!
<p>
Falls diese Annahmen stimmen, dann hat sich die Kommunikationskultur in den Datennetzen
seither tats&auml;chlich bedeutend weiterentwickelt: Von plumpen Beleidigungen zu
raffiniertem Psychoterror, der den Gegner so demoralisieren kann, da&szlig; er von selbst
um seine Einweisung in eine geschlossene Anstalt ersuchen wird.
<p>
Flames, das sind die Keulen des Cyberspace. Die beste und einzige Waffe, sich
durchzusetzen in der Anarchie der Netze. Gebrauche sie richtig, und Du bist der King.
Netiquette? Nie geh&ouml;rt. Es gilt das Recht des St&auml;rkeren. In einer Welt, in der Du weder
Gesicht noch Stimme hast, z&auml;hlen nur Syntax, Wortwahl und Orthographie. Und wer nicht
will, da&szlig; seine Texte untergehen im Meer der Messages, das sich Tag f&uuml;r Tag &uuml;ber
die Newsserver des Usenet ergie&szlig;t, der mu&szlig; eben zusehen, da&szlig; er auff&auml;llt zwischen all
den staubtrockenen Infojunkies,  selbstverliebten Quasselstrippen und Langweilern.
<p>
Davon abgesehen ist Flaming nat&uuml;rlich ein intellektuelles Vergn&uuml;gen ganz besonderer
Art. Allein sich auszumalen, wie der Adressat der brilliant formulierten Niedermache
vor Wut in die Tastatur bei&szlig;t und sich am n&auml;chsten Tag aus Angst vor neuen
Angriffen nicht einmal mehr traut, seinen Rechner einzuschalten - da lacht das
Flamer-Herz.
<p>
Gelegenheit, den Flammenwerfer auszupacken, gibt es mehr als genug. Die Newsgroups
sind schlie&szlig;lich voll von naiven, sachlich falschen oder gar beleidigenden Messages,
die nach einer passenden Antwort verlangen (siehe auch links). Nat&uuml;rlich sind nicht
alle ihre Verfasser w&uuml;rdige Gegner, aber jede Flame ist eine gute Gelegenheit, dem
Rest des Netzes zu zeigen, wer hier der Boss ist.
<p>
Ein guter Anfang ist immer ein langes, wohl&uuml;berlegtes Posting, am besten zu einem
politischen oder ethischen Thema, in das der Autor offensichtlich viel M&uuml;he gesteckt
hat. Dieses zitiere man vollst&auml;ndig und schreibe kurz &quot;V&ouml;lliger Bl&ouml;dsinn!&quot; darunter.
Entweder erh&auml;lt man als Antwort ein &quot;Wieso?&quot; und eine wiederholte Darlegung der
Argumente - womit der andere schon verloren hat und sich weitere Flames er&uuml;brigen.
Oder er geht zum Gegenangriff &uuml;ber, stellt Mutma&szlig;ungen &uuml;ber Intelligenzquotienten
oder Kinderstube des Angreifenden an, und schon ist man mitten drin in einem
wunderbaren Flame-War.
<p>
Das wichtigste am Flaming ist die Sprache. Die ideale Wortwahl mag von Gegner zu
Gegner unterschiedlich sein, und in manchen F&auml;llen sind elegant konstruierte
Schimpfkanonaden schon der Schl&uuml;ssel zum Erfolg. Sollte man es aber mit einer
intelligenteren Lebensform als Fliegendreck zu tun haben, ist ein m&ouml;glichst hohes
Sprachniveau die sicherste Waffe. Flaming-Experten wie der Amerikaner Chris Rolleston
empfehlen deshalb den massiven Einsatz von Fremdsprachen, insbesondere des Lateinischen.
Ein l&auml;ssig eingestreutes &quot;ad hominem&quot; ist schon eo ipso ein Gewinnpunkt.
Allerdings: Umgeben von wohlselektierten Fachtermini entbehrt auch ein ad&auml;quat
positioniertes &quot;Du Sau!&quot; nicht einer gewissen Wirkung.
<p>
&quot;Ich bin perfekt, der andere ist ein Depp.&quot; Wenn man nach dieser ausgefeilten
Grundstrategie vorgeht, ergibt sich alles weitere meist von selbst. Zum Beispiel, da&szlig;
es immer ratsam ist, die eigene Autorit&auml;t zu untermauern, etwa in dem man als Zeugen
f&uuml;r seine Position befreundete Insider aus dem Bundestag, dem Innenministerium oder
der Gesch&auml;ftsf&uuml;hrung von Microsoft heranzieht. Oder indem man aus seiner eigenen
Doktorarbeit - besser noch: Habilitationsschrift - zitiert (die ja schon sooo lange
zur&uuml;ckliegt). Vorsicht: Akademisch versierte Flamer sind in der Lage, so etwas
nachzupr&uuml;fen.
<p>
Umgekehrt gilt selbstverst&auml;ndlich: Kein Argument des anderen wird anerkannt, das
nicht bis ins kleinste Detail belegt wurde. Und selbstverst&auml;ndlich sind s&auml;mtliche
Belege, die der andere vorbringt, gef&auml;lscht! Über kurz oder lang, wird er erkennen,
da&szlig; er so nicht mal seine eigene Existenz nicht beweisen kann. Dieses Paradoxon macht
ihn fertig. (Vorausgesetzt, er wei&szlig; &uuml;berhaupt, was ein Paradoxon ist.)
<p>
Falls sachlich wirklich einmal nichts mehr zu machen ist (zum Beispiel weil der
Gegner von zu vielen anderen Usern Unterst&uuml;tzung erf&auml;hrt), dann hei&szlig;t es:
Nebenkriegsschaupl&auml;tze er&ouml;ffnen. Dort kann man auf die peinliche Rechtschreibfehler
verweisen, oder auf technische Unzul&auml;nglichkeiten wie falsch konfigurierte Newsreader
und unleserliche Umlaute. Und schlie&szlig;lich l&auml;&szlig;t sich immer noch der Argumentationsstil
kritisieren. Im Zweifelsfall ist die Diskussionsstrategie des anderen faschistoid!
<p>
Wer hartn&auml;ckig genug ist, alle Skrupel beiseite schiebt und sich einen Dreck darum
schert, ob er bei der Netzgemeinde beliebt ist oder nicht, der hat beste Chancen,
jeden Flame-War zu gewinnen - und ist dann geachtet und gef&uuml;rchtet, was sowieso
weitaus besser ist.
<p>
Als Trainingsgel&auml;nde f&uuml;r Neueinsteiger empfehlen sich &uuml;brigens spezielle Newsgroups
wie alt.flame oder de.alt.flame - Reservate, in denen man auf lauter Masochisten
trifft, die richtiggehend hei&szlig; auf Flames sind. Auf Dauer also eine ziemlich
langweilige Angelegenheit - und nur etwas f&uuml;r Feiglinge.
</td>
</tr>
</table>


<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=5><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=4><a href="tc.htm"><b>Dokumentation: HTML</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="tcf.htm"><b>Verweise - projektintern und weltweit</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="tcfc.htm"><b>Projektverweise zu anderen HTML-Dateien</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tcfca.htm#a1"><b>Anzeigebeispiel: Verweis zu Datei im gleichen Verzeichnis</b></a></td>
</tr>
</table>
</td>
</tr>
</table>

<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>

