<html>
<head>
<title>SELFHTML: Verweise zu anderen WWW-Adressen</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tc.htm"><b>Dokumentation: HTML</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tcf.htm"><b>Verweise - projektintern und weltweit</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC><img src="xok.gif" width=30 height=30 border=0 alt="HTML2.0"> Verweise zu anderen WWW-Adressen</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Allgemeine Hinweise</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Verweis zu WWW-Adresse setzen</b></a>
<p>
<hr noshade  size=1 width=50% align=left color=#6666CC>
<p>

<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC>Allgemeine Hinweise</font></h2></a>
<p>
Sie k&ouml;nnen in Ihren eigenen HTML-Dateien auf jede beliebige WWW-Adresse, die Sie kennen, einen Verweis setzen. WWW-Adressen sind alle Adressen im Internet, die mit <b>http://...</b> beginnen.
<p>
Das World Wide Web lebt unter anderem von der Vernetzungsdichte, also von der Bereitschaft von Seitenanbietern, auf andere WWW-Seiten zu verweisen. Mit jedem Verweis auf eine andere WWW-Adresse nehmen Sie gewisserma&szlig;en an der &quot;World Wide Web Revolution&quot; teil. Mit solchen Verweisen signalisieren Sie Ihre Bereitschaft, Teil der &quot;weltweiten Netzgemeinschaft&quot; zu sein. 
<p>
Leider bestehen viele heutige Homepages aber aus nichts anderem als aus ein paar Handvoll Verweisen ins WWW. Das interessiert niemanden. Entweder spezialisieren Sie sich auf das Sammeln von Internet-Adressen. Dann m&uuml;ssen Sie mehrere tausend Adressen, sauber nach Kategorien getrennt, m&ouml;glichst noch mit Kurztext zu dem betreffenden Projekt, sammeln und als Web-Projekt anbieten, um Beachtung zu finden. Oder Sie schreiben etwas &uuml;ber ein bestimmtes Thema und sammeln gezielt alle Verweise zu anderen Projekten im WWW, die sich mit dem gleichen Thema besch&auml;ftigen.
<p>
Normalerweise d&uuml;rfen Sie Verweise auf fremde WWW-Projekte ungefragt setzen. Jeder Anbieter von WWW-Seiten sollte das wissen, und wenn er aus irgendwelchen Gr&uuml;nden keinen Verweis auf die eigenen Seiten haben will, sollte er dies auf seinen Seiten ausdr&uuml;cklich sagen.
<p>
Wenn Sie einen Verweis ins WWW mitten in einem eigenen Text anbieten, ist der Kontext zu beachten. So k&ouml;nnen Sie nat&uuml;rlich auch &quot;Ha&szlig;-Verweise&quot; mit entsprechendem Kommentar setzen. In solchen F&auml;llen kann Ihnen jedoch eine juristische Beleidigungs-Klage von seiten des &quot;Verwiesenen&quot; drohen - die Realit&auml;t des heutigen WWW ist von der &quot;echten&quot; Realit&auml;t nicht mehr so weit entfernt, auch wenn es noch etliche juristische L&uuml;cken zur Definition von &quot;Internet-Delikten&quot;gibt.



<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a2"><h2><font color=#6666CC> <img src="xok.gif" width=30 height=30 border=0 alt="HTML2.0"> Verweis zu WWW-Adresse setzen</font></h2></a>

<img src="xview.gif" width=30 height=20 border=0 alt="Beispiel"><br>
<a href="tcfda.htm#a2"><b>Anzeigebeispiel: So sieht's aus</b></a>
<p>

<a name="ia_href_gatter"><h4><font color=#6666CC>Beispiel:</font></h4></a>
<table width=100% cellpadding=10><tr><td bgcolor=#FFFFCC>
<pre>
&lt;a href=&quot;http://www.hway.net/teamone/spanien/&quot;&gt;Zentralspanien mit dem Fahrrad&lt;/a&gt;
</pre></td></tr></table><p>


<h4><font color=#6666CC>Erl&auml;uterung:</font></h4>
F&uuml;r das Setzen des Verweises gilt das <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcfa.htm#a1"><b>Schema f&uuml;r alle Verweise in HTML</b></a>. Das Verweisziel ist die gew&uuml;nschte WWW-Adresse.

<h4><font color=#6666CC>Beachten Sie:</font></h4>
Viele Adressen bestehen nur aus dem Namen einer &quot;WWW-Domain&quot;, etwa <b>http://www.netzwelt.com/</b>. Trotzdem f&uuml;hrt der Verweis auf eine konkrete HTML-Datei. Das liegt daran, da&szlig; es bei vielen WWW-Servern einen sogenannten Default-Dateinamen gibt - meistens <b>index.htm</b>, <b>index.html </b>oder <b>welcome.htm</b> bzw. <b>welcome.html</b>. Das Projekt mu&szlig; nat&uuml;rlich auch eine entsprechende Datei besitzen. Im Verweis braucht die HTML-Datei aber nicht mit angegeben zu werden.
<p>
Viele solcher Adressen werden immer wieder ohne abschlie&szlig;enden Schr&auml;gstrich angegeben, etwa http://www.netzwelt.com. Es ist jedoch sauberer, wenn Sie noch den Schr&auml;gstrich dahinter setzen. Nur so kann der WWW-Browser bereits am Verweis erkennen, da&szlig; es sich um ein Verzeichnis handelt, in der eine Default-Datei steht, deren Namen der WWW-Server zur Verf&uuml;gung stellt. Es ist deshalb besser zu notieren: <b>http://www.netzwelt.com/</b>.




<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<table>
<tr><td></td><td colspan=2 align=center><font size=-1>Bl&auml;ttern:</font></td><td></td></tr>
<tr>
<td><a href="tcfc.htm"><b>Projektverweise zu anderen HTML-Dateien</b></a></td>
<td><img  src="x3.gif" width=15 height=10 border=0>&nbsp;<img  src="xgprev.gif" width=10 height=10 border=0></td>
<td align=right><img  src="xgnext.gif" width=10 height=10 border=0>&nbsp;<img  src="x3.gif" width=15 height=10 border=0></td>
<td><a href="tcfe.htm"><b>Verweise zu FTP, Gopher, Telnet, Newsgroups</b></a></td>
</tr>
</table>
<p>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tc.htm"><b>Dokumentation: HTML</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tcf.htm"><b>Verweise - projektintern und weltweit</b></a></td>
</tr>
</table>
<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>

