<html>
<head>
<title>SELFHTML: Tips zum Umgang mit Frames</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tc.htm"><b>Dokumentation: HTML</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tci.htm"><b>Frames - mehrere Bildschirmfenster</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC>Tips zum Umgang mit Frames</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Sinnvolle Einsatzm&ouml;glichkeiten f&uuml;r Frames</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Unfaire Schaufenster-Effekte</b></a> <br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Frames und  Gestaltung</b></a>

<p>
<hr noshade  size=1 width=50% align=left color=#6666CC>
<p>

<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC>Sinnvolle Einsatzm&ouml;glichkeiten f&uuml;r Frames</font></h2></a>
Frames - Informationsverteilung auf mehrere, voneinander unabh&auml;ngige Fenster - sind ein faszinierendes Werkzeug, aber auch ein Werkzeug, mit dem man viel verkehrt machen kann. Generell gilt: jeder Einsatz von Frames mu&szlig; gerechtfertigt sein. Das bedeutet: die Verwendung der Frame-Technik mu&szlig; dem Anwender als sinnvoll und vorteilhaft erscheinen. Wer Frames aus purem Selbstzweck einsetzt, mu&szlig; damit rechnen, als technikverliebter HTML-Novize statt als souver&auml;ner Web-Designer betrachtet zu werden.
<p>
Der Grund daf&uuml;r ist, da&szlig; Frames nicht wegzudiskutierende Nachteile haben:
<ul>
<li><b>Probleme bei nicht Frame-f&auml;higen WWW-Browsern:</b><br>
Frames werden nicht von allen WWW-Browsern angezeigt. Da die gesamte Struktur eines auf Frames basierenden Projekts von der Struktur herk&ouml;mmlicher Projekte entscheidend abweicht, kann ein Anbieter von Frames solchen Anwendern, die keine Frames anzeigen k&ouml;nnen, entweder gar keine Alternative anbieten, oder eine &quot;zweigleisige&quot; Alternative, die sehr aufwendig zu realisieren und zu pflegen ist.
<p>
<li><b>Frames und Bildschirmaufl&ouml;sung</b><br>
Bei kleineren Bildschirmen, z.B. bei 14-Zoll-Monitoren mit einer Bildschirmaufl&ouml;sung von 640x480 Pixeln, sind mehr als zwei Frame-Fenster bereits eine Zumutung f&uuml;rs Auge und die &Uuml;bersicht.
<p>
<li><b>Ladezeiten</b><br>
Frames verlangen mehr HTTP-Kommunikation zwischen Browser und Server. Im WWW kann es unter ung&uuml;nstigen Verh&auml;ltnissen leichter zu l&auml;ngeren Ladezeiten kommen. 
<p>
<li><b>Problematisches Direktansteuern von untergeordneten Seiten</b><br>
Es ist zwar theoretisch m&ouml;glich, aber meistens nicht im Sinne des Anbieters, wenn andere Anwender ein Lesezeichen oder einen Verweis auf eine HTML-Datei setzen, die Teil eines Frame-Sets ist. Das ist in vielen F&auml;llen &auml;rgerlich. So wird beispielsweise anderen Informationsanbietern die M&ouml;glichkeit genommen, in einem bestimmten Informationszusammenhang auf eine bestimmte Seite in einem fremden Projekt zu verweisen.
</ul>
<p>
In folgenden F&auml;llen ist der Einsatz von Frames f&uuml;r den Anwender am ehesten nachvollziehbar:
<ul>
<li><b>zum schnellen Wechseln zwischen Informationseinheiten</b><br>
In diesem Fall enth&auml;lt ein Frame-Fenster ein umfangreiches Verzeichnis mit anklickbaren Verweisen auf einzelne Informationsseiten, die in einem anderen, festen Frame-Fenster angezeigt werden. Das &quot;Inhaltsverzeichnis&quot; bleibt also jederzeit eingeblendet, und der Anwender kann zu jedem Zeitpunkt einen neuen Verweis daraus ausw&auml;hlen. Das erspart dem Anwender den wiederholten R&uuml;cksprung von den einzelnen Informationsseiten auf das &uuml;bergeordnete Verzeichnis.<br>
<i>Beispiel:</i> ein Anbieter von Ferienappartments kann alle zur Verf&uuml;gung stehenden Objekte in einem Verweis-Verzeichnis auflisten und das jeweils ausgew&auml;hlte Objekt in einem festen anderen Frame-Fenster anzeigen.
<p>
<li><b>zum st&auml;ndigen Einblenden projektglobaler Steuerverweise</b><br>
Bei umfangreichen Projekten, in denen dem Anwender das Gef&uuml;hl des &quot;lost in hyperspace&quot; droht, ist es sinnvoll, in einem separaten Frame-Fenster immer g&uuml;ltige Steuerverweise anzubieten, z.B. zur Homepage, zur n&auml;chsth&ouml;heren logischen Ebene, zum Stichwortverzeichnis oder zur Suchdatenbank. Bei kleinen Projekten, die nur aus einer Handvoll Seiten bestehen, wirkt diese Technik dagegen &uuml;bertrieben und vermittelt dem Anwender eine falsche Vorstellung von der Gr&ouml;&szlig;e des Projekts. Wenn der Anwender in einem solchen Fall nach wenigen Mausklicks feststellt, da&szlig; er bereits alles gesehen hat, wird er um so entt&auml;uschter sein. In HTML 3.2 ist das st&auml;ndige Einblenden projektglobaler Steuerverweise auch in Form von <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcbe.htm"><b>Standardverweisen</b></a> realisierbar. Leider hat sich diese HTML-Technik bislang nicht durchgesetzt und wird von den kommerziellen WWW-Browsern nicht unterst&uuml;tzt.<br>
<i>Beispiel:</i> Eine Zeitung, die im WWW ein gro&szlig;es Archiv mit &auml;lteren Artikeln anbietet, k&ouml;nnte mit Hilfe der Frame-Technik st&auml;ndige Verweise zu einem thematisch sortierten Zugangsverzeichnis, zu einem Stichwortverzeichnis und einer Volltext-Suchdatenbank f&uuml;r die einzelnen Artikel anbieten.
<p>
<li><b>zum gleichzeitigen Anzeigen von zu vergleichenden Informationen</b><br>
Hypertext bedeutet nicht nur, dem Anwender per Mausklick weitere Informationen zur Verf&uuml;gung zu stellen, sondern auch, dem Anwender die M&ouml;glichkeit zu bieten, sich selbst Informationen so zusammenzustellen, da&szlig; er sie optimal miteinander vergleichen und daraus Schl&uuml;sse oder Entscheidungen ableiten kann. Zu diesem Zweck eignet sich die Frame-Technik hervorragend, da sie es erlaubt, verschiedene, getrennt voneinander gespeicherte Informationen auf Anwenderwunsch gleichzeitig anzuzeigen.<br>
<i>Beispiel:</i> Eine Verbraucherberatung k&ouml;nnte in einem viergeteilten Frame-Set in zwei Frames zwei gleichartig aufgebaute Verweis-Verzeichnisse zu Produkttests anbieten. Im dritten Frame-Fenster wird der Produkttest angezeigt, den der Anwender im ersten Frame-Fenster mit Verweisen ausw&auml;hlt; im vierten Frame-Fenster kann der Anwender einen Produkttest anzeigen, den er im zweiten Frame-Fenster mit Verweisen ausw&auml;hlt. Auf diese Weise kann der Anwender beliebige getestete Produkte direkt miteinander vergleichen. Voraussetzung hierzu ist nat&uuml;rlich, da&szlig; alle Produkttests einen einheitlichen Aufbau und ein einheitliches Bewertungsschema haben, um direkte Vergleiche zu erlauben. 
<p>
<li><b>bei besonders kunstvoller Seitengestaltung</b><br>
In diesem Fall mu&szlig; der Anwender auf den ersten Blick erkennen k&ouml;nnen, da&szlig; die Frame-Technik eine bestimmte k&uuml;nstlerische Aussage unterst&uuml;tzen soll. 
</ul>


<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a2"><h2><font color=#6666CC>Unfaire Schaufenster-Effekte</font></h2></a>
Mit Hilfe von Frames ist es auch m&ouml;glich, fremde WWW-Seiten innerhalb eines Frame-Fensters im eigenen Web-Projekt darzustellen. Dies ist jedoch sehr problematisch und in den meisten F&auml;llen unfair. Denn auf diese Weise verkommen fremde WWW-Seiten zu &quot;Schaufenstern&quot; innerhalb des eigenen Web-Projekts. Das ist eine unfeine Geste gegen&uuml;ber den Fremdanbietern, weil es das eigene Web-Projekt in den Augen des Anwenders als &quot;Mega-Projekt&quot; erscheinen l&auml;&szlig;t. W&uuml;nschenswert w&auml;re hierzu ein HTML-Befehl, der es jedem Seitenanbieter erlaubt, seine Seiten vor solchen Schaufenster-Effekten zu sch&uuml;tzen und stattdessen im vollen Anzeigefenster darzustellen. Netscape, der &quot;Erfinder&quot; der Frame-Technik, hat bei Einf&uuml;hrung der Frame-Technik zwar derartige Mechanismen versprochen, bis heute aber nichts dergleichen implementiert.
<p>
So kann es auch passieren, da&szlig; in einem Frame-Fenster eine Fremdanbieter-Seite angezeigt wird, die ihrerseits Frames einsetzt. So kommt es zu einem &auml;rgerlichen &quot;Fraktal-Effekt&quot; von Frame-Fenstern auf dem Bildschirm des Anwenders.
<p>
Wenn Sie innerhalb eines Frame-Projekts auf fremde Seiten verweisen, sollten Sie eine der folgenden M&ouml;glichkeiten w&auml;hlen:
<ul>
<li><b>Urspr&uuml;nglichen Fensterzustand wiederherstellen</b><br>
Setzen Sie den Verweis so, da&szlig; der Anwender Ihr definiertes Frame-Set verl&auml;&szlig;t und wieder den Fensterzustand erh&auml;lt, den er vor Aufruf Ihres Projekts hatte. Dies erreichen Sie durch Verweise von der Art<br>
<tt><font color=#6666CC>&lt;a href=&quot;http://...&quot; target=&quot;_parent&quot;&gt;Verweistext&lt;/a&gt;</font></tt>
<p>
<li><b>Doppelverweis anbieten</b><br>
Dadurch &uuml;berlassen Sie dem Anwender die Entscheidung, wie er die fremde Seite angezeigt bekommen will. Notieren Sie zwei Verweise direkt unter- oder nebeneinander, die das gleiche Ziel haben, etwa in der Weise<br>
<tt><font color=#6666CC>&lt;a href=&quot;http://...&quot; target=&quot;RechtsUnten&quot;&gt;Fremde Seite im Frame rechts unten anzeigen&lt;/a&gt;&lt;br&gt;</font></tt><br>
<tt><font color=#6666CC>&lt;a href=&quot;http://...&quot; target=&quot;_parent&quot;&gt;Fremde Seite voll anzeigen&lt;/a&gt;</font></tt><br>
<p>
<li><b>Anwender auf M&ouml;glichkeit zum Ver&auml;ndern der Frames hinweisen</b><br>
Wenn Sie keine der beiden anderen M&ouml;glichkeiten anbieten wollen, sollten Sie wenigstens das Ver&auml;ndern der Frame-Fenstergr&ouml;&szlig;en durch den Anwender erlauben und den Anwender auf diese M&ouml;glichkeit explizit hinweisen. Um das Ver&auml;ndern der Frame-Fenster durch den Anwender zu erlauben, <b>verzichten</b> Sie einfach auf die Zusatzangabe <b>&quot;noresize&quot;</b> im <b>&lt;frame&gt;</b>-Tag.
</ul>




<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a3"><h2><font color=#6666CC>Frames und  Gestaltung</font></h2></a>
Mindestens ein Frame-Fenster sollte einen unver&auml;nderbaren Inhalt haben. Wenn Sie etwa mit zwei Frame-Fenstern arbeiten, sollte das eine davon konstant eingeblendete Verweise und das andere die variabel anzuzeigenden Verweisziele enthalten. Wenn Sie drei Frame-Fenster einsetzen, sollte ein Fenster eine konstante Leiste mit wichtigen, projektsteuernden Navigationsverweisen enthalten. Vor allem bei umfangreichen Projekten ist es wichtig, dem Anwender so eine Steuerleiste zu bieten, auf die er sich verlassen kann. Dadurch wird er eher ermutigt, sich in die Tiefen des Projekts zu begeben.
<p>
Eine herk&ouml;mmliche WWW-Seite, also eine HTML-Datei, meist mit Hintergrundbild und referenzierten Grafiken, enth&auml;lt schon genug T&uuml;cken, wenn es um &auml;sthetische Optimierung geht. Wenn Sie, wie in einem Frame-Set, zwei, drei oder vier herk&ouml;mmlicher WWW-Seiten gleichzeitig anzeigen und so zu einer verbinden, wird die &auml;sthetische Kontrolle des Bildschirmgeschehens entsprechend schwieriger. Wenn Sie Frames verwenden, ist es noch wichtiger als bei &quot;einzelnen&quot; WWW-Seiten, auf ein einheitliches, nachvollziehbares Design und eine klare Farbgestaltung zu achten. Denn beim Einsatz von Frames wissen Sie vorher nie, welche Dateien der Anwender gleichzeitig am Bildschirm anzeigt. Deshalb m&uuml;ssen Sie Ihr Projekt so gestalten, da&szlig; jede denkbare Anzeigekombination am Bildschirm gut aussieht. Farben sollten, wenn sie unterschiedlich sind, entweder miteinander harmonieren oder kontrastieren. Bedenken Sie auch, da&szlig; es bei mehreren Dateien, deren Farbgebung und Grafiken unterschiedliche Farbpaletten verwenden, durch Dithering zu unerw&uuml;nschten Darstellungseffekten kommen kann (mehr hierzu im Abschnitt <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tfb.htm#a2"><b>Farbpaletten</b></a>).



<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<table>
<tr><td></td><td colspan=2 align=center><font size=-1>Bl&auml;ttern:</font></td><td></td></tr>
<tr>
<td><a href="tcid.htm"><b>Eingebettete Frames</b></a></td>
<td><img  src="x3.gif" width=15 height=10 border=0>&nbsp;<img  src="xgprev.gif" width=10 height=10 border=0></td>
<td align=right><img  src="xgnext.gif" width=10 height=10 border=0>&nbsp;<img  src="x3.gif" width=15 height=10 border=0></td>
<td><a href="tcja.htm"><b>Style-Sheets in HTML einbinden</b></a></td>
</tr>
</table>
<p>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tc.htm"><b>Dokumentation: HTML</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tci.htm"><b>Frames - mehrere Bildschirmfenster</b></a></td>
</tr>
</table>
<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>

