<html>
<head>
<title>SELFHTML: Animierte GIF-Grafiken</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tf.htm"><b>Grundwissen Grafik</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC>Animierte GIF-Grafiken</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Allgemeines zu animierten GIF-Grafiken</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Diashow-Effekte durch animierte GIF-Grafiken</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Daumenkino-Effekte durch animierte GIF-Grafiken</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Vorgehensweise beim Erstellen animierter GIF-Grafiken</b></a>
<p>
<hr noshade  size=1 width=50% align=left color=#6666CC>
<p>

<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC>Allgemeines zu animierten GIF-Grafiken</font></h2></a>
Das <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tfa.htm#a11"><b>GIF-Format</b></a> unterst&uuml;tzt in der neueren, 89er Version die M&ouml;glichkeit, mehrere Grafiken in ein und derselben Grafikdatei zusammenzufassen. Die Einzelgrafiken der Datei werden nacheinander &quot;abgespult&quot; und angezeigt. Dabei ist es auch m&ouml;glich, Kontroll-Befehle mit abzuspeichern, z.B. Verz&ouml;gerungszeiten zwischen den einzelnen Bildern. Dieses Feature bietet Ihnen zwei interessante Einsatzm&ouml;glichkeiten:
<ul>
<li>Sie k&ouml;nnen eine automatisch ablaufende &quot;Dia-Show&quot; mehrerer verschiedener Bilder programmieren.
<li>Sie k&ouml;nnen eine Sequenz &auml;hnlicher und aufeinander aufbauender Bilder in einer GIF-Datei speichern. Dadurch ergibt sich ein &quot;Daumenkino-Effekt&quot;, d.h. eine einfache Video-Animation.
</ul>
Mit Hilfe von animierten GIF-Grafiken k&ouml;nnen Sie also bewegte Elemente auf Ihre WWW-Seiten bringen, ohne in Programmiersprachen wie Java einsteigen zu m&uuml;ssen.
<p>
Beachten Sie aber auch, da&szlig; animierte GIF-Grafiken schnell eine kritische Gr&ouml;&szlig;e erreichen. Denn mehrere Einzelgrafiken in einer Grafikdatei ben&ouml;tigen zwangsl&auml;ufig mehr Speicher. Animationen sollten Sie daher nur aus kleinen Grafiken erzeugen.
<p>
Derzeit wird das Erstellen animierter GIF-Grafiken von den professionellen Grafikprogrammen noch nicht unterst&uuml;tzt. Es gibt Zusatzprogramme, mit deren Hilfe Sie bereits vorhandene Grafiken zu animierten Grafiken zusammenstellen k&ouml;nnen:
<p>
Das <b>GIF Construction Set</b> f&uuml;r Windows 16 und 32 Bit.<br>
<img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.mindworkshop.com/alchemy/gifcon.html"><b>GIF Construction Set downloaden</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0>
<p>
Das Programm <b>GIF Merge f&uuml;r Unix</b>.<br> 
<img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.iis.ee.ethz.ch/~kiwi/GIFMerge/"><b>GIF Merge downloaden</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0>
<p>
Das Programm <b>GIF Builder f&uuml;r Macintosh</b>.<br> 
<img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://iawww.epfl.ch/Staff/Yves.Piguet/clip2gif-home/GifBuilder.html"><b>GIF Builder downloaden</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0>
<p>
Die deutschsprachige Sammelstelle f&uuml;r alle Informationen und Links rund um das Thema animierte GIF-Grafiken ist das Projekt <img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.zampano.com/gifanim/"><b>Zampano GIF-Animationen im WWW</b></a>&nbsp;<img src="xdeu.gif" width=16 height=10 border=0>. Dort finden Sie eine umfangreiche Galerie animierter GIF-Grafiken und neueste Infos zu Software und Tools.
<p>
Beachten Sie, da&szlig; animierte GIF-Grafiken nicht von allen WWW-Browsern korrekt dargestellt werden. In manchen F&auml;llen kann es dabei zu unsch&ouml;nen Anzeige-Effekten kommen.



<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a2"><h2><font color=#6666CC>Diashow-Effekte durch animierte GIF-Grafiken</font></h2></a>
Diashow-Effekte k&ouml;nnen Sie z.B. verwenden, um in schneller Abfolge die typischen Produkte Ihrer Firma anzuzeigen, oder um in einem interaktiven Lernprojekt zum Erlernen einer Fremdsprache neue Vokabeln kurz einzublenden (&quot;unterbewu&szlig;t lernen&quot;). Sie k&ouml;nnen auch mehrere mit einer Gesamtbedeutung assoziierten Bilder in Reihe schalten und auf diese Weise animierte Symbole oder animierte Cliparts pr&auml;sentieren. Wichtig ist, da&szlig; die Einzelbilder f&uuml;r den Anwender einen nachvollziehbaren Zusammenhang ergeben. Die Anzeigedauer der Einzelbilder k&ouml;nnen Sie frei einstellen.

<h3><font color=#6666CC>Typische Diashow-Effekte</font></h3>
<pre>
<img src="xanim01.gif" width=150 height=50 border=0><img src="xanim02.gif" width=150 height=150 border=0>
</pre>

<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a3"><h2><font color=#6666CC>Daumenkino-Effekte durch animierte GIF-Grafiken</font></h2></a>
Daumenkino-Effekte k&ouml;nnen sie z.B. verwenden, um Cliparts zu einfachen Trickfilmsequenzen zu erweitern, um wissenschaftliche Ablaufprozesse zu visualisieren, oder um in der technischen Dokumentation Handgriffe und andere zeitliche Abl&auml;ufe zu verdeutlichen. Die Geschwindigkeit der Bildsequenzen und damit die Ablaufgeschwindigkeit k&ouml;nnen Sie frei einstellen.

<h3><font color=#6666CC>Typische Daumenkino-Effekte</font></h3>
<pre>
<img src="xanim03.gif" width=64 height=64 border=0>&nbsp;<img src="xanim04.gif" width=40 height=40 border=0>
</pre>




<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a4"><h2><font color=#6666CC>Vorgehensweise beim Erstellen animierter GIF-Grafiken</font></h2></a>
Bevor Sie eine animierte Grafik erstellen k&ouml;nnen, m&uuml;ssen Sie folgende Vorbereitungen treffen:
<ul>
<li>Sie m&uuml;ssen die Einzelbilder mit Hilfe eines geeigneten <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tbdc.htm"><b>Grafikprogramms</b></a> erstellen bzw. ausw&auml;hlen.
<p>
<li>Sie sollten alle Bilder in neue Grafikdateien mit einheitlicher Breite und H&ouml;he und einheitlicher <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tfb.htm#a2"><b>Farbpalette</b></a> kopieren.
<p>
<li>Speichern Sie alle auf diese Weise erzeugten Bilder als GIF-Grafiken ab. Vergeben Sie dabei am besten durchnumerierte Dateinamen wie &quot;bild1.gif&quot;, &quot;bild2.gif&quot; usw., und zwar in der Reihenfolge, in der Sie die Bilder sp&auml;ter als Einzelbilder in der animierten Grafik ablegen wollen.
</ul>
Nachdem Sie diese Vorbereitungen getroffen haben, k&ouml;nnen Sie die Software zum Erstellen der animierten GIF-Grafik aufrufen. Da die Bedienung solcher Programme sehr unterschiedlich ist, wird hier nicht n&auml;her auf einzelne Bedienschritte eingegangen. In jedem Fall stehen Ihnen folgende M&ouml;glichkeiten zur Verf&uuml;gung:
<ul>
<li><b>Bild (image):</b> Indem Sie eine GIF-Grafik einf&uuml;gen, wird diese Grafik als Einzelbild in die animierte Grafik &uuml;bernommen.
<p>
<li><b>Schleife (loop):</b> Indem Sie eine Schleife einf&uuml;gen, k&ouml;nnen Sie bestimmen, wie oft die gesamte Bildsequenz wiederholt werden soll. Sie k&ouml;nnen einen Zahlenwert editieren, der die Anzahl der Abspielwiederholungen angibt.
<p>
<li><b>Kontrollelement (control):</b> Indem Sie ein Kontrollelement einf&uuml;gen, k&ouml;nnen Sie den Ablauf zwischen zwei Einzelbildern kontrollieren. Sie k&ouml;nnen z.B. die Verz&ouml;gerung bis zur Anzeige des n&auml;chsten Einzelbilds einstellen. Ferner k&ouml;nnen Sie Angaben zum <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tfe.htm#a1"><b>transparenten Hintergrund</b></a> der Einzelbilder machen, oder festlegen, da&szlig; das n&auml;chste Einzelbild erst dann angezeigt wird, wenn der Anwender eine Taste dr&uuml;ckt oder die Maus bewegt.
<p>
<li><b>Text (plain text):</b>: Indem Sie Text einf&uuml;gen, k&ouml;nnen Sie den Ablauf der animierten Grafik zus&auml;tzlich durch eingeblendete Textteile erg&auml;nzen. Dabei k&ouml;nnen Sie den Text formatieren.
<p>
<li><b>Kommentare (comments):</b> Indem Sie Kommentare einf&uuml;gen, k&ouml;nnen Sie Ihre Arbeiten intern auskommentieren. Solche Kommentare werden nicht mit angezeigt.
</ul>
Um das fertige Ergebnis zu betrachten, brauchen Sie nat&uuml;rlich ein geeignetes Anzeigeprogramm. Einige Editierprogramme f&uuml;r animierte GIF-Grafiken bieten selbst die M&ouml;glichkeit des Betrachtens an. Wenn nicht, k&ouml;nnen Sie die Grafik auch mit Ihrem WWW-Browser lokal &ouml;ffnen und betrachten.



<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<table>
<tr><td></td><td colspan=2 align=center><font size=-1>Bl&auml;ttern:</font></td><td></td></tr>
<tr>
<td><a href="tfc.htm"><b>Typische Grafiksorten für WWW-Seiten</b></a></td>
<td><img  src="x3.gif" width=15 height=10 border=0>&nbsp;<img  src="xgprev.gif" width=10 height=10 border=0></td>
<td align=right><img  src="xgnext.gif" width=10 height=10 border=0>&nbsp;<img  src="x3.gif" width=15 height=10 border=0></td>
<td><a href="tfe.htm"><b>Transparenter Hintergrund</b></a></td>
</tr>
</table>
<p>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tf.htm"><b>Grundwissen Grafik</b></a></td>
</tr>
</table>
<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>

