<html>
<head>
<title>SELFHTML: Anti-Aliasing</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tf.htm"><b>Grundwissen Grafik</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC>Anti-Aliasing</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Anti-Aliasing als Mittel f&uuml;r professionelle Grafiken</b></a>
<p>
<hr noshade  size=1 width=50% align=left color=#6666CC>
<p>

<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC>Anti-Aliasing als Mittel f&uuml;r professionelle Grafiken</font></h2></a>
<img src="xtff1.gif" width=120 height=200 border=0 alt="Anti-Aliasing" align=left hspace=20>Anti-Aliasing ist ein Algorithmus f&uuml;r <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tfa.htm#a2"><b>Pixelgrafiken</b></a>, um sichtbare Treppeneffekte an harten Kanten oder Farb&uuml;berg&auml;ngen in Grafiken auszugleichen. An der nebenstehenden Grafik k&ouml;nnen Sie den Effekt gut beobachten. Die 4fach vergr&ouml;&szlig;ert dargestellten &quot;V&quot;s im oberen Teil zeigen den Unterschied zwischen einem grafischen Schriftzug mit und ohne Anti-Aliasing. Im Wort &quot;Verdana&quot; im unteren Teil sehen Sie, wie sich Anti-Aliasing in einem Schriftzug in Echtgr&ouml;&szlig;e auswirkt. Mit Anti-Aliasing wirkt das angezeigte Wort deutlich weicher und angenehmer. Bei schr&auml;gen Strichen oder Rundungen werden Treppeneffekte abgeschw&auml;cht.
<p>
Besonders bei Schriftz&uuml;gen innerhalb von Grafiken ist Anti-Aliasing ein Mittel f&uuml;r mehr Professionalit&auml;t. Aber auch bei anderen Objekten mit Schr&auml;gen oder Kurven bietet sich Anti-Aliasing an, um die R&auml;nder weichzuzeichnen und sichtbare Pixeltreppen zu vermeiden.
<p>
Gute Grafikprogramme unterst&uuml;tzen den Anti-Aliasing-Effekt. Das Problem dabei ist normalerweise, da&szlig; Pixelgrafiken keine &quot;Objekte&quot; enthalten, die man einfach markieren kann, um ihnen Eigenschaften - wie zum Beispiel den Anti-Aliasing-Effekt - zuzuweisen. Programme wie Photoshop, Corel Photo Paint und in Ans&auml;tzen inzwischen auch Paintshop Pro bieten die M&ouml;glichkeit, Pixelbereiche, die ein erkennbar zusammenh&auml;ngendes Muster darstellen, als Objekt zu markieren. Solchen markierten Objekten k&ouml;nnen Sie dann die Eigenschaft des Anti-Aliasing zuweisen. N&auml;here Informationen dazu entnehmen Sie bitte der Dokumentation der Grafiksoftware. 
<p>
Anti-Aliasing ist jedoch kein Allheilmittel. Wenn alle grafischen Elemente weichgezeichnet werden, entsteht irgendwann ein Weichsp&uuml;lmittel-Effekt. 
<p>
<h4><b><font color=#6666CC>Hinweis</font></b></h4>
&quot;Verdana&quot; - das Wort, das der Schriftzug in der Grafik darstellt, ist eine Schriftart. Das Wort in der Grafik ist in dieser Schriftart dargestellt. &quot;Verdana&quot; geh&ouml;rt zu den ersten sogenannten &quot;Web-Schriftarten&quot;. Das sind Schriftarten, die bei modernen WWW-Browsern mit dabei sind und von diesen automatisch mit installiert werden. Sinn der Sache ist, solchen Schriftarten zu weiter Verbreitung zu verhelfen und sie damit f&uuml;r <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcdk.htm#a3"><b>Schriftarten in HTML</b></a> und f&uuml;r <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcjb.htm"><b>Style-Sheet-Angaben</b></a> nutzbar zu machen. Die Schriftart Verdana wird mit dem MS Internet Explorer ab Version 3.0 ausgeliefert. Es handelt sich um eine serifenlose, am Bildschirm gut lesbare Schrift.
<br clear=all>








<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<table>
<tr><td></td><td colspan=2 align=center><font size=-1>Bl&auml;ttern:</font></td><td></td></tr>
<tr>
<td><a href="tfe.htm"><b>Transparenter Hintergrund</b></a></td>
<td><img  src="x3.gif" width=15 height=10 border=0>&nbsp;<img  src="xgprev.gif" width=10 height=10 border=0></td>
<td align=right><img  src="xgnext.gif" width=10 height=10 border=0>&nbsp;<img  src="x3.gif" width=15 height=10 border=0></td>
<td><a href="tga.htm"><b>Checkliste f&uuml;r die Projektplanung</b></a></td>
</tr>
</table>
<p>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tf.htm"><b>Grundwissen Grafik</b></a></td>
</tr>
</table>
<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>

