<html>
<head>
<title>SELFHTML: Checkliste f&uuml;r die Projektplanung</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tg.htm"><b>Projektverwaltung</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC>Checkliste f&uuml;r die Projektplanung</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>HTML-basierte Projekte / WWW-Projekte</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Projekt-Chekliste</b></a>
<p>
<hr noshade  size=1 width=50% align=left color=#6666CC>
<p>

<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC>HTML-basierte Projekte / WWW-Projekte</font></h2></a>
Bis vor kurzem meinte man, wenn man von &quot;Hypertext&quot; sprach, 
in der Regel einzelne, separate Hypertext-Anwendungen. Das sind mehr 
oder weniger gro&szlig;e Projekte, die mit bestimmten Hypertext-Programmen 
editiert und pr&auml;sentiert werden und auf lokalen Rechnern oder 
LAN-Netzwerken laufen. Typische Projekte dieser Art sind Hyper-Lexika, 
Dokumentarchive usw. Bekannte Hypertext-Programme f&uuml;r solche 
Anwendungen sind Hypercard (Macintosh), Guide (MS-Windows) oder Augment 
(Workstation-Umgebungen).
<p>
Im Zusammenhang mit dem World Wide Web dagegen kommt eine neue Dimension 
hinzu: die weltweite Vernetzung. Das bedeutet jedoch nicht, da&szlig; 
das WWW eine weltweite Hypertext-Anwendung ist. Vielmehr ist es eine 
einheitliche, normierte Plattform f&uuml;r Hypertext-Projekte, mit der 
M&ouml;glichkeit, projekt&uuml;bergreifende, weltweite Verweise zu 
anderen Projekten zu setzen.
<p>
Die einzelnen Projekte im WWW sind oft abh&auml;ngig von den Ideen 
und Zielen der einzelnen Server-Betreiber. Nat&uuml;rlich gibt es auch 
unstrukturierte Server, bei deren Inhalt kein Konzept erkennbar ist. 
Doch auch solche Server enthalten lauter kleine &quot;Zellen&quot;, 
die Hypertext-Projekte darstellen. Denn zweifellos ist jedes Firmen-, 
Vereins- oder Personenportrait, das aus einer Handvoll untereinander 
vernetzter HTML-Dateien besteht, ein kleines Hypertext-Projekt.
<p>
Hypertext-Projekte im WWW sollten stets zwei Anforderungen gen&uuml;gen: 
sie sollten zum einen in sich geschlossen sein, d.h. dem Anwender im 
WWW-Browser als ein erkennbar geschlossenes Ganzes erscheinen; zum anderen 
sollten sie aber auch der Tatsache Rechnung tragen, da&szlig sie Teil 
einer weltweiten Plattform sind, d.h. dem Anwender im WWW-Browser die 
M&ouml;glichkeit bieten, zu anderen Projekten im WWW zu wechseln.



<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a2"><h2><font color=#6666CC>Projekt-Chekliste</font></h2></a>

<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a21"><b>Ziel des Projekts</b></a><br>
(Was soll erreicht werden? Eine Idee vorstellen, Unterhaltung bieten, 
eine Firma vorstellen, Information vermitteln, bestimmte Produkte anbieten?)<br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a22"><b>Zielgruppe des Projekts</b></a><br>
(Akademiker, Jedermann, Gesch&auml;ftsleute, bestimmtes Fachpublikum?)<br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a23"><b>Daten-Ressourcen</b></a><br>
(Vorhandenes Schriftgut, vorhandene elektronische Daten, Neuerstellung?)<br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a24"><b>Aufwand</b></a><br>
(Terminvorgaben, Arbeitsstunden, Speicherbedarf, Pflegeaufwand?)<br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a25"><b>Gliederung und Strukturierung</b></a><br>
(Verweisstruktur, Informationsverteilung auf HTML-Dateien?)<br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a26"><b>Corporate Identity</b></a><br>
(Logo, Kopf-/Fu&szlig;zeilen, Farben, Layout?)


<p><a href="#a2"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a21"><h3><font color=#6666CC>Ziel des Projekts</font></h3></a>
Beispiele f&uuml;r m&ouml;gliche Ziele eines Projekts:
<ul>
<li> Wir als Firma stellen uns und unsere Produkte/Dienstleistungen vor
<li> Wir als Firma bieten eine Dienstleistung direkt &uuml;ber diese 
WWW-Seiten an<p>
<li> Ich als Einzelperson stelle meine Aktivit&auml;ten in meinem 
Fachgebiet/Hobby vor
<li> Ich als Einzelperson veranstalte auf diesen WWW-Seiten ein 
pers&ouml;nliches Happening<p>
<li> Wir als Institution/Organisation/Verband/Verein stellen unsere 
Ziele und Aktivit&auml;ten vor
<li> Wir als Institution/Organisation/Verband/Verein bieten Ihnen die 
M&ouml;glichkeit, &uuml;ber diese WWW-Seiten an einer bestimmten Aktion 
teilzunehmen<p>
<li> Ich/Wir stelle(n) auf diesen WWW-Seiten einen gro&szlig;en 
Datenbestand aus einem bestimmten Sachgebiet zur allgemeinen 
Verf&uuml;gung
<li> Ich/Wir sammeln auf diesen WWW-Seiten in loser Weise alles, was zu 
einem bestimmten Sachgebiet geh&ouml;rt
</ul>
Die voranstehende Liste mit Beispielen will zeigen, da&szlig; es erstens 
sehr unterschiedliche Ziele eines Hypertext-Projekts im WWW geben kann, 
und da&szlig; auch ein und derselbe Anbieter von WWW-Seiten 
unterschiedliche Ziele verfolgen kann.
<p>
Wichtig ist, da&szlig; Sie sich in der Konzeptphase eines Hypertext-Projekts 
f&uuml;r das WWW &uuml;ber das oder die Ziele des Projekts im klaren werden, 
und da&szlig; Sie dem Anwender, der Ihre Seiten aufruft, gleich zu Beginn 
(auf der Einstiegsseite) klar machen, welches Ihre Ziele sind. Das kann 
explizit geschehen durch S&auml;tze wie: &quot;<i>XY begr&uuml;&szlig;t Sie. 
Auf diesen Seiten stellen wir uns und unsere innovative Technik vor 
usw.</i>&quot;, oder &quot;<i>Light your fire and feel free to loose 
yourself into this hyperspace</i>&quot;. Es kann aber auch durch die 
Aufmachung der Startseite geschehen. So vermittelt eine neutral aufgebaute 
Startseite (ohne Hintergrundbilder, animierte Grafiken, JavaScript usw.) 
wissenschaftliche Seriosit&auml;t; eine gestylte, aber &uuml;berlegen 
statische Seite suggeriert beim Anwender eine gro&szlig;e, etablierte 
Firma oder Institution oder ein Projekt von monumentalen 
Au&szlig;ma&szlig;en. Eine poppige, nach Aufmerksamkeit schreiende Seite 
dagegen verr&auml;t eine kleine, werbende Firma oder ein freakiges, nicht 
ganz so ernst zu nehmendes Projekt.


<p><a href="#a2"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a22"><h3><font color=#6666CC>Zielgruppe des Projekts</font></h3></a>
Genauso wichtig wie eine Zielsetzung ist es, die Zielgruppe zu bestimmen, 
die durch das Projekt angesprochen werden soll. M&ouml;gliche 
Zielgruppen sind z.B.:
<ul>
<li> Potentielle Kunden/K&auml;ufer
<li> Hobbyisten/Liebhaberkreise
<li> Wissenschaftler/Experten
<li> Kinder und Jugendliche
<li> Familien
<li> Computerfreaks/Hacker
<li> Vergn&uuml;gungss&uuml;chtige
<li> Neugierige
<li> Sinnsuchende
</ul>
Nat&uuml;rlich k&ouml;nnen Sie versuchen, alle Besucher ihrer WWW-Seiten 
zufriedenzustellen. Das wird allerdings ziemlich schwer, und es besteht 
die Gefahr, da&szlig; Sie niemanden so richtig zufrieden stellen. Besser 
ist es, sich vorzustellen, wie bestimmte Leute, die auf Ihre WWW-Seiten 
sto&szlig;en, sofort ein Lesezeichen darauf setzen, weil sie gleich 
erkennen, da&szlig; dies Seiten sind, die mit ihren eigenen Interessen, 
ihrem Wissensdurst, ihrer Lebensart oder ihren W&uuml;nschen, Gedanken 
und Hoffnungen zu tun haben.
<p>
Ebenso wie die Zielvorgabe Ihres Projekts sollte dem Anwender auch die 
adressierte Zielgruppe klargemacht werden. Dazu eignen sich explizite 
S&auml;tze wie: &quot;<i>Allen Fahrrads&uuml;chtigen bieten wir auf diesen 
Seiten technische Neuigkeiten und Tourenvorschl&auml;ge</i>&quot. Aber auch 
die Aufmachung der Startseite selektiert das Publikum. Dabei h&auml;ngt 
allerdings viel vom Zusammenspiel der Elemente ab. Ein dunkler 
Sternenhimmel als Hintergrundbild spricht joystickverliebte Cybernauten 
ebenso an wie entr&uuml;ckte Esoteriker. Erst die Vordergrundsymbolik 
(z.B. grelle Strahlen aus Laserwaffen, die ein Monster treffen, oder 
wehender wei&szlig;er Schleier, der auf eine Pyramide zufliegt) sorgt 
in solchen F&auml;llen f&uuml;r intuitiv klare Verh&auml;ltnisse.
<p>
Wenn Sie speziellere Information anbieten wollen, sollten Sie sich 
auch die Frage stellen, ob es im WWW &uuml;berhaupt ein Publikum f&uuml;r 
dieses Angebot gibt. Prinzipiell ist im WWW zwar alles m&ouml;glich, aber 
wenn Sie m&ouml;glichst viele Leute erreichen wollen und dabei blind auf 
das Web setzen, k&ouml;nnten Sie m&ouml;glicherweise eine 
Entt&auml;uschung erleben. Auch k&ouml;nnte es sein, da&szlig; es das, 
was Sie anbieten wollen, l&auml;ngst schon gibt. Deshalb sollten Sie 
sich vorher schlau machen. &Uuml;berlegen Sie sich zu diesem Zweck ein 
paar Stich- und Schl&uuml;sselworte, die Ihr Projekt charakterisieren. 
<p>
<form method=get action="http://altavista.digital.com/cgi-bin/query">
<table cellpadding=12 width=100%><tr><td bgcolor=#FFFFCC>
<h4>Durchsuchen Sie das WWW nach einem Stichwort!</h4>
<input type=hidden name=pg value=q>
<select name=what>
<input name=q size=55 maxlength=200 value="">
<input type=submit value="Suche starten">
</td></tr></table>
</form>
<p>
&Uuml;ber das voranstehende Eingabefeld k&ouml;nnen Sie einen Datenbestand von zig Millionen Web-Seiten nach einem Stichwort durchsuchen. Es handelt sich um einen Aufruf der Datenbank des Suchdienstes Altavista.
<p>
Werten Sie die Suchergebnisse nach folgenden Kriterien aus:
<ul>
<li> Gibt es gar nichts zu diesen Suchbegriffen? Das kann bedeuten, 
da&szlig; die Welt auf genau das wartet, was Sie anbieten wollen. Es kann 
aber auch bedeuten, da&szlig; das niemanden in der Welt interessiert. 
In diesem Fall ist es angebracht, mit einer kleinen, nicht so aufwendigen 
Projektversion zu beginnen und Feedback abzuwarten.
<li> Gibt es uferlos viel zu den Suchbegriffen? Das kann bedeuten, da&szlig; 
Ihre Pl&auml;ne voll im Trend liegen, aber auch, da&szlig; Sie hier nicht 
mehr viel Neues werden bieten k&ouml;nnen. Folgen Sie den Verweisen der 
Suchergebnisse und analysieren Sie sorgf&auml;ltig, was es bereits gibt, und 
was Sie Neues bieten k&ouml;nnen (z.B. &quot;erstes Angebot dieser Art 
in deutscher Sprache&quot;).
</ul>
Nur wenn Sie sich mit der potentiellen Zielgruppe auseinandersetzen, 
werden Sie Web-Surfer &quot;gezielt&quot; erreichen k&ouml;nnen.




<p><a href="#a2"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a23"><h3><font color=#6666CC>Daten-Ressourcen</font></h3></a>
Die folgende kurze Liste versteht sich als Gedankenansto&szlig; zum 
Thema &quot;Datenquellen und Datenverarbeitung&quot;
<ul>
<li> Gibt es vorhandene Daten, z.B. Firmenprospekt, wissenschaftliche 
Aufs&auml;tze, Dokumentarchive? (wenn nicht, wo soll die &quot;Substanz&quot; 
dann eigentlich herkommen? Es gibt leider viele WWW-Projekte, die an so einem Mangel an Substanz kranken und das mit einem permanenten &quot;under construction&quot; kaschieren wollen)
<li> Liegen die Daten elektronisch in Dateiform vor? (wenn ja, in 
welcher Form? Es ist herauszufinden, wie die Daten am besten in HTML 
konvertiert werden k&ouml;nnen. Wenn nein, gibt es gedruckte Daten auf 
Papier, die man einscannen kann? Wobei das Einscannen nur in Verbindung 
mit einer Schriftenerkennungs-Software sinnvoll ist.)
<li> Sollen laufend eintreffende neue Daten, z.B. Nachrichten, verarbeitet 
werden? (wenn ja, ist zu &uuml;berlegen, ob man die Daten jedesmal per 
Hand in HTML aufbereiten soll, oder ob die Entwicklung eines Programms 
lohnt, da&szlig; den HTML-Code automatisch generiert)
<li> Sollen Daten fremder Anbieter integriert werden? (wenn ja, ist zu 
&uuml;berlegen, ob den Fremdanbietern ein einheitliches Layout vorgegeben 
werden soll, das in Form von &quot;Roh-HTML-Dateien&quot; zu 
erstellen w&auml;re)
</ul>


<p><a href="#a2"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a24"><h3><font color=#6666CC>Aufwand</font></h3></a>
Der Aufwand eines WWW-Projekts verteilt sich auf folgende Bereiche:
<ul>
<li> Konzept- und Planung
<li> Realisierung
<li> Pflege
</ul>
In allen F&auml;llen handelt es sich um Zeitaufwand, der nicht zu 
untersch&auml;tzen ist. Wenn Sie aus Begeisterung oder als Hobbyist arbeiten, 
werden Sie die Formel Zeit=Geld nicht so sehr empfinden, aber wenn Sie 
kommerziell arbeiten, m&uuml;ssen Sie f&uuml;r alle drei genannten 
Bereiche Kalkulationen anstellen. In allen F&auml;llen jedoch, auch wenn 
Sie nicht kommerziell arbeiten, sollten Sie eines tun: Termine setzen. 
Denn ohne selbst gesetzte Termine wird ein Projekt nie fertig. Die Termine 
sollten allerdings realistisch sein. Ein Termin, der nicht zu halten ist, 
ist nicht mehr wert als kein Termin.
<p>
Wenn Sie Geld f&uuml;r das Projekt investieren m&uuml;ssen, sind folgende 
Abw&auml;gungen wichtig:
<ul>
<li> <b>Selbst- oder Fremdarbeit:</b> ist es g&uuml;nstiger, sich 
selbst die Zeit (=Geld) zu nehmen, um sich in Konzept und Realisierung 
(=HTML, Know How) einzuarbeiten, oder ist es besser, jemanden zu beauftragen 
(= ebenfalls Geld), der sich damit auskennt und dies &uuml;bernimmt? Wenn 
es sich um einmal zu erstellende Daten handelt, ist die Fremdbeauftragung 
wohl g&uuml;nstiger. Bei pflege-intensiven Projekten ist die 
Selbsteinarbeitung vorzuziehen.
<li> <b>Rentabilit&auml;t:</b> wie empfindlich treffen Sie die 
anfallenden Kosten? K&ouml;nnen Sie sich leisten, da&szlig; das Projekt 
ein Flop wird? F&uuml;r erfolgreiches Publizieren oder Werben im WWW gibt 
es noch keine Ma&szlig;st&auml;be. Wenn ein Flop Ihren Untergang bedeutet, 
sollten Sie es vielleicht erst mal mit risikoloseren Investitionen 
versuchen.
</ul>
Im Web pr&auml;sent sein hei&szlig;t &quot;in&quot; sein. Aber belanglose 
Werbung oder Allerweltsinformation bringen weder dem Web noch Ihrem 
Geldbeutel etwas. Das Web braucht Juwelen, um eine Sensation zu bleiben. 
Und Juwelen sind teuer. Eigentlich k&ouml;nnen nur Besessene so viel aufbringen.



<p><a href="#a2"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a25"><h3><font color=#6666CC>Gliederung und Strukturierung</font></h3></a>
Ein WWW-Projekt besteht aus wenigstens einigen, oft aus vielen, manchmal 
aus unz&auml;hligen HTML-Dateien. Je mehr Dateien das Projekt enth&auml;lt, 
desto wichtiger wird eine schriftliche Fixierung der Datei- bzw. 
Verweisstruktur. Aber auch bei kleinen Projekten, die nur aus wenigen 
Dateien bestehen, sollten Sie sich vorher &uuml;berlegen, was in welche 
Datei geh&ouml;rt, und wie die Dateien vernetzt werden sollen.
<p>
Hypertext zwingt Sie nicht zu bestimmten Formen. Hypertext ist 
ein nicht-lineares Medium. Der Anwender soll nicht der Reihe nach lesen, 
sondern ausw&auml;hlen, was ihn interessiert. Das ist eine gro&szlig;e 
Freiheit, birgt jedoch zugleich die Gefahr des &quot;lost in 
hyperspace&quot; - Gef&uuml;hls.
<p>
Die meisten Anwender im WWW sind keine erfahrenen Hypertext-Piloten. 
Bei Projekten, die aus mehr als einer Handvoll Seiten bestehen, sollten Sie deshalb versuchen, dem Anwender eine &quot;Metapher&quot; zu bieten, an die er sich halten kann. M&ouml;gliche Metaphern:
<ul>
<li> <b>Buchmetapher:</b> das Projekt hat Dokumentcharakter, besitzt ein 
Inhaltsverzeichnis und evtl. ein Stichwortverzeichnis, Dateien entsprechen 
Kapiteln usw. Diese Metapher eignet sich besonders f&uuml;r 
begrenzte Information zu bestimmten Themen, wobei die Daten selten 
upgedatet werden.
<li> <b>Verzeichnis- oder Baummetapher:</b> das Projekt wirkt auf den Anwender wie ein Dateimanager. Es gibt Dateien mit Verweislisten, die durch ein Ordnersymbol gekennzeichnet werden, und Dateien mit Information, die durch Dokumentsymbole gekennzeichnet werden. Diese Metapher eignet sich besonders f&uuml;r gro&szlig;e Datenbest&auml;nde mit h&auml;ufigen Neuzug&auml;ngen, wobei jedoch der Informationsbereich, der abgedeckt wird, von vorneherein bekannt ist.
<li> <b>die Indexmetapher:</b> ein gro&szlig;es, alphabetisch oder nach anderen Kriterien (z.B. Datum, Zeit) sortiertes Verweisverzeichnis bildet den 
Zugang zur Information. Diese Metapher eignet sich besonders f&uuml;r 
Projekte, deren Informationsbereich nicht genau eingrenzbar ist, und 
bei denen h&auml;ufig neue Daten hinzukommen.
</ul>
Sobald der Anwender Ihre beabsichtigte Metapher erkennt, kann er sich eine 
&quot;r&auml;umliche Vorstellung&quot; Ihres Projekts machen. Das ist 
eine ganz wichtige Sache, die Sympathie des Anwenders gegen&uuml;ber dem 
Projekt h&auml;ngt tats&auml;chlich zum gro&szlig;en Teil davon ab, ob er 
diesen Aha-Effekt hat oder nicht.


<p><a href="#a2"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a26"><h3><font color=#6666CC>Corporate Identity</font></h3></a>
Genauso wichtig wie ein Gliederungskonzept ist ein 
Corporate-Identity-Konzept. Das bedeutet, da&szlig; alle Dateien, die zu 
einem Projekt geh&ouml;ren, ein optisch einheitliches Bild bieten, damit 
der Anwender intuitiv erkennt, da&szlig er sich noch im gleichen Projekt 
befindet. Corporate Identity stellen Sie her, indem Sie bestimmte 
Gestaltungselemente bei jeder Datei des Projekts wiederverwenden. Das 
k&ouml;nnen sein:
<ul>
<li> Ein Logo. Es sollte an immer gleicher Stelle auf der Seite stehen, zum Beispiel immer links oben am Seitenanfang. Wenn Sie mit der Frame-Technik arbeiten, k&ouml;nnen Sie das Logo auch in einem fixen Bildschirmbereich plazieren.
<li> Grafische Symbole. Das sind kleine GIF- oder JPEG-Grafiken, die an 
bestimmten Stellen stehen und eine f&uuml;r den Anwender sofort erkennbare 
bzw. nachvollziehbare Bedeutung haben. Symbole k&ouml;nnen z.B. bedeuten: 
&quot;dies ist ein Beispiel&quot;, oder &quot;dies ist eines unserer 
Produkte&quot; oder &quot;dies ist ein Verweis, mit dem der Anwender das 
Projekt verl&auml;&szlig;t&quot;.
<li> Textformate. Dazu geh&ouml;rt z.B., Beispiele immer in dicktengleicher 
Schrift darzustellen.
</ul>
Corporate Identity suggeriert Geschlossenheit. Besonders bei kommerziellen 
Projekten, also bei Firmen, die sich vorstellen oder direkt etwas anbieten, 
vermittelt Corporate Identity dem Anwender das Gef&uuml;hl, es mit 
erfahrenen Profis zu tun zu haben.






<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<table>
<tr><td></td><td colspan=2 align=center><font size=-1>Bl&auml;ttern:</font></td><td></td></tr>
<tr>
<td><a href="tff.htm"><b>Anti-Aliasing</b></a></td>
<td><img  src="x3.gif" width=15 height=10 border=0>&nbsp;<img  src="xgprev.gif" width=10 height=10 border=0></td>
<td align=right><img  src="xgnext.gif" width=10 height=10 border=0>&nbsp;<img  src="x3.gif" width=15 height=10 border=0></td>
<td><a href="tgb.htm"><b>Vorhandene Daten in HTML konvertieren</b></a></td>
</tr>
</table>
<p>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tg.htm"><b>Projektverwaltung</b></a></td>
</tr>
</table>
<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>

