<html>
<head>
<title>SELFHTML: WWW-Projekte publizieren</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tg.htm"><b>Projektverwaltung</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
</a>
<h1><font color=#6666CC>WWW-Projekte publizieren</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Allgemeines</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Homepages bei Online-Diensten</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a3"><b>Kostenlose Homepages bei diversen Anbietern</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a4"><b>Eigene Domain-Adressen</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a5"><b>Eigene Server-Rechner</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a6"><b>Publizieren mit FTP - File Transfer Protocol</b></a>
<p>
<hr noshade  size=1 width=50% align=left color=#6666CC>
<p>

<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC> Allgemeines</font></h2></a>
Um eigene, auf HTML basierende Projekte im WWW zu publizieren, brauchen Sie:
<ol>
<li><b>Einen Internet-Zugang</b>. Wenn Sie noch keinen Internet-Zugang haben, m&uuml;ssen Sie sich einen Anbieter (Provider) suchen, der Ihnen einen Zugang vermittelt. Wichtig ist dabei, da&szlig; die Einwahlnummer, &uuml;ber die Sie sich ins Internet einw&auml;hlen k&ouml;nnen, im Orts- oder Nahbereich liegt, damit sich die Telefonkosten in Grenzen halten. Aber auch verschiedene andere Faktoren spielen eine Rolle, zum Beispiel die Tarife der Provider, Sonderkonditionen, Volumen- oder Zeitbeschr&auml;nkungen usw. Die meisten Privatleute gehen inzwischen &uuml;ber einen der gro&szlig;en Online-Dienste ins Internet, zum Beispiel &uuml;ber T-Online, CompuServe, MSN oder AOL. Es gibt jedoch eine Unzahl lokaler Anbieter, deren Konditionen von Fall zu Fall g&uuml;nstiger sind. Au&szlig;erdem gibt es gr&ouml;&szlig;ere Provider, etwa Eunet, bei denen der Internet-Zugang teuerer ist, die aber daf&uuml;r bessere &Uuml;bertragungsraten versprechen. Nachdem Sie sich bei einem Provider angemeldet haben, erhalten Sie eine User-ID und ein Pa&szlig;wort. Mit diesen beiden Daten k&ouml;nnen Sie sich dann &uuml;ber eine Einwahlnummer, die Sie ebenfalls von Ihrem Provider erhalten, per Modem oder ISDN-Karte ins Internet einw&auml;hlen. Voraussetzung ist allerdings noch, da&szlig; Sie Internet-Software auf Ihrem Rechner haben. Dazu geh&ouml;rt eine sogenannte Internet-Socket-Software (unter Windows z.B. die Datei <i>winsock.dll</i>) sowie geeignete Front-End-Software (etwa einen WWW-Browser). 
<p>
<li><b>Festspeicherplatz auf einem Server-Rechner</b>, der ans Internet angeschlossen ist und mindestens die Internet-Protokolle HTTP und FTP unterst&uuml;tzt. Wenn Sie keinen eigenen Server-Rechner betreiben wollen (was sehr teuer ist), m&uuml;ssen Sie dazu Speicherplatz bei einem Anbieter (Provider) mieten. Es gibt eine F&uuml;lle von Anbietern, die Speicherplatz im WWW vermieten. Die Leistungen und Preise sind sehr unterschiedlich. Sie m&uuml;ssen herausfinden, welche Leistungen Sie brauchen, und wo Sie diese Leistungen am g&uuml;nstigsten bekommen. In vielen F&auml;llen k&ouml;nnen Sie bei dem Provider, bei dem Sie Ihren Internet-Zugang haben, auch Speicherplatz f&uuml;r eigene WWW-Projekte mieten. So bieten heute praktisch alle gro&szlig;en Online-Dienste neben dem Internet-Zugang auch die M&ouml;glichkeit an, eigene Homepages ins Internet zu bringen.
<p>
<li><b>Eine WWW-Adresse</b>. Dabei gibt es unterschiedliche Typen. Bei Online-Diensten oder Billig-Angeboten erhalten Sie beispielsweise Adressen vom Typ <i>http://www.IhrProvider.com/IhrVerzeichnis/</i>. Den Verzeichnisnamen d&uuml;rfen Sie sich bei der Anmeldung normalerweise selbst aussuchen. Wenn Sie eine eigene Domain-Adresse wollen, also beispielsweise eine Adresse vom Typ <i>http://www.IhrName.com/</i>, m&uuml;ssen Sie diese bei einer Vergabebeh&ouml;rde im Internet beantragen. Die meisten Provider, &uuml;ber die Sie so eine Adresse mieten k&ouml;nnen, &uuml;bernehmen dies gegen eine Geb&uuml;hr.
<p>
<li><b>Einen gesch&uuml;tzten Zugang zu dem Festspeicherplatz auf dem Server-Rechner</b>. Dazu erhalten Sie von dem Provider, bei dem Sie den Speicherplatz mieten, eine Kennung. Die besteht normalerweise aus einer User-ID und einem Pa&szlig;wort. In den meisten F&auml;llen k&ouml;nnen Sie Ihr Pa&szlig;wort jederzeit selbst &auml;ndern.
<p>
<li><b>Software zum Hochladen und Verwalten der eigenen Daten auf dem Server-Rechner</b>. Der klassische Internet-Dienst zum &Uuml;bertragen von Dateien und zum Ausf&uuml;hren einfacher Dateioperationen auf dem Server-Rechner (L&ouml;schen, Kopieren, Verschieben, Zugriffsschutz festlegen usw.) ist das <i>File Transfer Protocol (FTP)</i>. Dazu gibt es FTP-Software, die Sie auf Ihrem Rechner installieren m&uuml;ssen. Bei manchen Anbietern k&ouml;nnen oder m&uuml;ssen Sie spezielle Software verwenden, die Ihnen der Provider zur Verf&uuml;gung stellt. Solche L&ouml;sungen bieten z.B. CompuServe und AOL.
</ol>



<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a2"><h2><font color=#6666CC> Homepages bei Online-Diensten</font></h2></a>

Diese L&ouml;sung sollten Sie anvisieren, wenn Sie bereits einen Internet-Zugang &uuml;ber so einen Online-Dienst (T-Online, CompuServe, AOL usw.) haben und einfach nur eine private oder interessensorientierte Homepage im Internet publizieren wollen. 
<p>
Bei den genannten Online-Diensten erhalten Sie derzeit zwischen 1 und 10 Megabyte Festplattenspeicher im Internet. Dorthin k&ouml;nnen Sie HTML-Dateien, Grafiken und meistens auch Multimedia-Dateien hochladen, die dann als WWW-Seiten weltweit zug&auml;nglich sind. Es gibt jedoch auch Beschr&auml;nkungen. So bieten die Online-Dienste in der Regel nicht die M&ouml;glichkeit einer eigenen CGI-Schnittstelle an, wo Sie eigene Scripts ablegen k&ouml;nnen. Wenn Sie solche Dinge wie Zugriffsz&auml;hler, G&auml;steb&uuml;cher oder Nachrichtenforen nutzen wollen, sind Sie auf <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tbba.htm#a3"><b>&ouml;ffentliche CGI-Dienste</b></a> angewiesen.
<p>
Wenn Sie bereits einen Zugang zu einem Online-Dienst haben und erw&auml;gen, &uuml;ber diesen Anbieter Ihre Homepage zu publizieren, erkundigen Sie sich bitte innerhalb des Online-Dienstes danach, was Sie brauchen und wie alles im einzelnen funktioniert. Bei CompuServe, AOL oder T-Online gibt es entsprechende Foren, in denen Sie diese Fragen stellen k&ouml;nnen.
<p>
Daneben k&ouml;nnen Sie sich auf entprechenden Unterseiten folgender WWW-Angebote informieren:
<p>
<img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.compuserve.de/"><b>CompuServe</b></a>&nbsp;<img src="xdeu.gif" width=16 height=10 border=0><br>
<img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.aol.com/"><b>American Online (AOL)</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0><br>
<img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.dtag.de/prodserv/"><b>Deutsche Telekom - Dienstleistungen</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0>



<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a3"><h2><font color=#6666CC> Kostenlose Homepages bei diversen Anbietern</font></h2></a>

Diese L&ouml;sung ist sinnvoll, wenn Sie bereits einen Internet-Zugang haben, Ihr Provider aber keine M&ouml;glichkeit anbietet, Ihre eigene Homepage ins WWW zu stellen. Wenn Sie keine kommerzielle Information anbieten wollen, sondern Information zu Wissensgebieten, Hobbys usw. &ouml;ffentlich zug&auml;nglich machen wollen, ist es absolut nicht einzusehen, warum Sie f&uuml;r Ihre freiwillige M&uuml;he auch noch 
zus&auml;tzlich Geld bezahlen sollen. 
<p>
Gl&uuml;cklicherweise gibt es mittlerweile viele Anbieter, die jedem Interessenten kostenlosen Speicherplatz im WWW anbieten. Dabei erhalten Sie in der Regel 1 bis 5 Megabyte Speicherplatz, was f&uuml;r die meisten Privatprojekte durchaus ausreicht. Die Beschr&auml;nkungen sind &auml;hnlich wie bei den <img src="xgoup.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Online-Diensten</b></a>.
<p>
Anbieter, die kostenlos WWW-Speicherplatz zur Verf&uuml;gung stellen, finden Sie im WWW:
<p>
<img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.schlund.de/homepage.htm"><b>Schlund &amp; Partner</b></a>&nbsp;<img src="xdeu.gif" width=16 height=10 border=0><br>
<img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.tripod.com/tripod/membership/signup/"><b>Tripod</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0><br>
<img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.geocities.com/"><b>Geocities</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0><br>
<img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.shop.de/php/info.htm"><b>PHP</b></a>&nbsp;<img src="xdeu.gif" width=16 height=10 border=0><br>
<img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://yi.com/hck.htm"><b>Yellow Internet (YI)</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0>

 



<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a4"><h2><font color=#6666CC> Eigene Domain-Adressen</font></h2></a>

Diese L&ouml;sung sollten alle Firmen, alle gr&ouml;&szlig;ere Institutionen usw. w&auml;hlen. Auch Anbieter, die wichtige Projekte mit hohen zu erwartenden Besucherzahlen im WWW anbieten wollen, sollten diese L&ouml;sung anvisieren. Bei Firmennamen sollte das blo&szlig;e Eintippen von <i>www.Firmenname.com</i> oder <i>www.Firmenname.de</i> (Deutschland), <i>www.Firmenname.at</i> (&Ouml;sterreich) bzw. <i>www.Firmenname.ch</i> (Schweiz) im WWW-Browser gen&uuml;gen, um die Homepage einer Firma aufzufinden. Immer weniger Anwender sind bereit, stundenlang in Suchdiensten nach der Homepage-Adresse eines Produkt- oder Dienstleistungsanbieters zu suchen.
<p>
Bei dieser L&ouml;sung brauchen Sie keinen eigenen Internet-Server-Rechner, aber Sie erhalten eine eigene Domain-Namensadresse. Man spricht dabei auch von &quot;virtuellen Domain-Adressen&quot;.
<p>
Jede Menge Einzelheiten zu einzelnen Providern, Leistungen und Preisen in diesem Angebotsbereich finden Sie im <img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.netzwelt.com/selfhtml/provider/tm.htm"><b>Provider-Vergleichsverzeichnis</b></a>&nbsp;<img src="xdeu.gif" width=16 height=10 border=0>, einem Online-Service des vorliegenden Dokuments. In diesem Angebotsbereich haben Sie etwa zwischen DM 50.- und 500.- monatliche Kosten. Daf&uuml;r bekommen Sie normalerweise ab 10 MB aufw&auml;rts Speicherplatz, die eigene Domain-Adresse, eigene E-Mail-Adressen, CGI-Schnittstellen, Zugriffsstatistiken, die M&ouml;glichkeit zum Anlegen pa&szlig;wortgesch&uuml;tzter Bereiche usw. Die Angebote sind in der Regel flexibel erweiterbar. Das hei&szlig;t, bei den meisten Providern k&ouml;nnen Sie f&uuml;r wenig Aufpreis E-Mail-Adressen, Speicherplatz oder andere Erweiterungen nach Bedarf bekommen.
<p>
Bei der eigenen Domain-Adresse m&uuml;ssen Sie zwischen dem Typ unterscheiden. COM-Adressen sind zum Beispiel wesentlich preiswerter als DE-Adressen. &Uuml;ber die meisten Provider k&ouml;nnen Sie mehrere oder alle Typen von Adressen reservieren lassen. F&uuml;r die Reservierung sind Institutionen im Internet zust&auml;ndig. DE ist eine Landeskennung, w&auml;hrend COM f&uuml;r Commercial steht und eine reine Typenkennung ist. 
<p>
Allgemeine Informationen zu Domain-Adressen erhalten Sie im WWW:
<p>
<img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.nic.de/"><b>Deutsches Network Information Center (DE-NIC)</b></a>&nbsp;<img src="xdeu.gif" width=16 height=10 border=0><br>

<img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.ripe.net/"><b>R&eacute;seaux IP Europ&eacute;ens (RIPE) </b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0><br>

<img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.internic.net/"><b>International Network Information Center (INTERNIC) </b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0>

<p>
Weitere Ausk&uuml;nfte erteilen Ihnen Provider, bei denen Sie solche L&ouml;sungen bekommen. Auch auf deren Homepages finden Sie h&auml;ufig weitere Informationen. 




<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a5"><h2><font color=#6666CC> Eigene Server-Rechner</font></h2></a>

Diese L&ouml;sung ist nur f&uuml;r Firmen und Institutionen sinnvoll, die selbst Internet-Dienste anbieten oder aus anderen Gr&uuml;nden einen unmittelbaren Leitungszugang zum Internet ben&ouml;tigen. Die Kosten f&uuml;r diese L&ouml;sung liegen im professionellen Bereich bei mehreren tausend Mark monatlich.

Folgendes ben&ouml;tigen Sie, um einen eigenen Rechner als Server-Rechner im WWW zu betreiben:
<ul>

<li>Moderne und leistungsf&auml;hige Hard- und Software (Workstation, Power-PC, Pentium usw.) 
mit 32- oder 64-Bit-Betriebssystemen und echtem Multitasking (Unix, OS/2, Windows NT) und 
ausreichenden Reserven (ab 64 MByte Arbeitsspeicher, 4 und mehr GByte Plattenspeicher usw.).<p>

<li>Server-Software zum Fahren von Internet-Protokollen (mindestens HTTP und FTP). Hierbei 
gibt es einfache Freeware-Pakete, aber auch Profi-Pakete, wie sie z.B. von Netscape angeboten werden.<br>
Eine Liste mit Verweisen zu Serversoftware gibt es im WWW: <img src="xgonline.gif" width=14 height=10 border=0>&nbsp;<a href="http://www.w3.org/hypertext/WWW/Servers.html"><b>World Wide Web Server Software</b></a>&nbsp;<img src="xdeu.gif" width=16 height=10 border=0><p>

<li>Einen Backbone-Internet-Provider (Anbieter) und eine physikalische Verbindung zu 
diesem Provider. Das ist eine Direktverbindung zwischen Ihrem Server-Rechner und dem Server-Rechner des Providers (in der Regel eine Standleitung mit 64 KBit/s oder 2 MBit/s &Uuml;bertragungskapazit&auml;t. F&uuml;r die Leitung zum Provider bezahlen Sie eine Monatsmiete, die je nach Leitungskapazit&auml;t und -l&auml;nge sehr hoch sein kann. 
</ul>

Um einen eigenen Server zu fahren, ist viel Know How erforderlich, auch wenn manche Server-Software-L&ouml;sungen das Gegenteil versprechen. Es sollte einen &quot;Webmaster&quot; geben, also einen Betreuer, der den Server-Rechner, seine Software, seine gespeicherten Inhalte, Konfigurationen usw. kennt und beurteilen kann, ob und welche Hard-/Software-Erweiterungen angesichts der Serverbelastung n&ouml;tig sind. Konfigurationsdaten sollten ausreichend dokumentiert sein.


<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a6"><h2><font color=#6666CC> Publizieren mit FTP - File Transfer Protocol</font></h2></a>

Wenn Sie nicht gerade selbst einen Server-Rechner besitzen und Systemadministrator sind, m&uuml;ssen Sie die Datenverwaltung (Dateien hochladen, l&ouml;schen usw.) auf dem Server von einem beliebigen Rechner mit einfachem Internet-Zugang aus erledigen. Das heute &uuml;bliche Internet-Protokoll dazu ist FTP (File Transfer Protocol). Manche Server bieten auch Telnet-Dienste zur Datenverwaltung an.
<p>
Normalerweise erhalten Sie von Ihrem Provider alle n&ouml;tigen Daten, die Sie brauchen, um Ihre Daten auf dem Server verwalten zu k&ouml;nnen. Was Sie dann noch brauchen, ist ein leistungsf&auml;higes FTP-Programm. FTP-Programme laufen mit der gleichen Internet-Socket-Verbindung wie WWW-Browser. In diesem Dokument finden Sie eine <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tbdd.htm"><b>Liste von FTP-Programmen</b></a>.
<p>
Die meisten modernen FTP-Programme haben grafische Oberfl&auml;chen, die bekannten Dateimanagern oder Datei-Commandern &auml;hneln. Sie ben&ouml;tigen dabei keine tieferreichenden Kenntnisse. Zum Zugriff auf den Server-Rechner brauchen Sie die FTP-Adresse Ihres Speicherbereichs, eine User-ID und ein Pa&szlig;wort. Alle drei Daten teilt Ihnen Ihr Provider mit. Die Daten k&ouml;nnen Sie bei den meisten modernen FTP-Programmen in einer integrierten FTP-Site-Verwaltung fest speichern. 
<p>
Einige Tips noch:
<ul>
<li>Wenn Ihr Projekt aus Unterverzeichnissen besteht, benennen Sie die Verzeichnisse auf dem lokalen Rechner, wo Sie das Projekt erstellen, genau so wie auf dem Server-Rechner. So k&ouml;nnen Sie besser kontrollieren, was wo steht. Au&szlig;erdem sollten die Verweise und Referenzen innerhalb des Projekts lokal genau so funktionieren wie auf dem Server.
<p>
<li>Wenn Sie einzelne Dateien lokal auf Ihrem Rechner aktualisiert oder hinzugef&uuml;gt haben, lassen Sie sich die Dateiliste vor dem Hochladen der Dateien auf den Server-Rechner nach Datum sortiert anzeigen. So sehen Sie besser, welche Dateien neu oder erneuert sind, und vergessen nichts beim Hochladen.
<p>
<li>Kontrollieren Sie nach jedem Hochladen von Dateien das Vorgangs-Protokoll, das Ihr FTP-Programm aufzeichnet. Wenn dort bei der &Uuml;bertragung von Dateien irgendwelche Fehler aufgezeichnet sind, laden Sie diese Dateien noch einmal hoch.
<p>
<li>Lassen Sie sich nach jedem Hochladevorgang den aktualisierten Inhalt auf dem Server-Rechner anzeigen und &uuml;berpr&uuml;fen Sie, ob die neuen Dateien angezeigt werden. Beachten Sie, da&szlig; die Anzeige von Datum und Uhrzeit auf dem Server-Rechner nicht unbedingt Ihrer lokalen Zeit entsprechen mu&szlig;. Viele Server-Rechner stehen in den USA und benutzen als Systemzeit die dort aktuelle Lokalzeit. Auch bei Dateigr&ouml;&szlig;en k&ouml;nnen Unterschiede zwischen lokaler Version und Server-Version einer Datei angezeigt werden. Das mu&szlig; jedoch nicht bedeuten, da&szlig; die Datei bei der &Uuml;bertragung besch&auml;digt wurde.
<p>
<li>Rufen Sie die neuen Dateien anschlie&szlig;end mit einem WWW-Browser auf, um zu kontrollieren, ob alles so funktioniert, wie es soll. 
</ul>


<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<table>
<tr><td></td><td colspan=2 align=center><font size=-1>Bl&auml;ttern:</font></td><td></td></tr>
<tr>
<td><a href="tgb.htm"><b>Vorhandene Daten in HTML konvertieren</b></a></td>
<td><img  src="x3.gif" width=15 height=10 border=0>&nbsp;<img  src="xgprev.gif" width=10 height=10 border=0></td>
<td align=right><img  src="xgnext.gif" width=10 height=10 border=0>&nbsp;<img  src="x3.gif" width=15 height=10 border=0></td>
<td><a href="tgd.htm"><b>WWW-Projekte bekannt machen</b></a></td>
</tr>
</table>
<p>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tc.htm"><b>Dokumentation: HTML</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tcd.htm"><b> Absatztypen und Textgestaltung</b></a></td>
</tr>
</table>
<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>

