<html>
<head>
<title>SELFHTML: Geschichte von HTML</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tb.htm"><b>Einf&uuml;hrung</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tba.htm"><b>Allgemeines zu HTML</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC>Geschichte von HTML</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Die Anf&auml;nge</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Der Boom</b></a>
<p>
<hr noshade  size=1 width=50% align=left color=#6666CC>


<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC>Die Anf&auml;nge</font></h2></a>
<img src="xtim.jpg" width=82 height=123 border=0 alt="Tim Berners-Lee" align=left hspace=10>Die Geschichte von HTML ist untrennbar mit der Geschichte des World Wide Web verbunden. Die Geschichte ist - trotz ihres unfa&szlig;baren Erfolges - noch ziemlich jung. Sie begann um 1990 in Genf. <img src="xgonline.gif"  width=14 height=10>&nbsp;<a href="http://www.w3.org/pub/WWW/People/Berners-Lee/"><b>Tim Berners-Lee</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0>, britischer Informatiker am Genfer Hochenergieforschungszentrum CERN, startete zusammen mit einigen Kollegen eine Initiative, um das Internet, dessen Geschichte schon viel &auml;lter ist, f&uuml;r einen neuartigen Informationsaustausch zwischen Wissenschaftlern zu nutzen. Es ging darum, eine M&ouml;glichkeit zu schaffen, wissenschaftliche Dokumente online sichtbar zu machen, wobei einfache Textformatierung und das Einbinden von Grafik m&ouml;glich sein sollte. Ganz entscheidend war aber auch die Idee, Hypertextfunktionalit&auml;t einzubauen, so da&szlig; Dokumente Verweise auf beliebige andere Dokumente enthalten k&ouml;nnen, auch, wenn diese auf ganz anderen Internet-Servern liegen.
<p>
Die beiden S&auml;ulen des Projekts sollten die neue Dokumentbeschreibungssprache HTML (<i>Hypertext Markup Language</i>) und ein neues High-Level-Internet-Protokoll, HTTP (<i>Hypertext Transfer Protocol</i>), bilden. Neue Endanwender-Software sollte die Dateien online anzeigen und Verweise ausf&uuml;hren k&ouml;nnen. Wegen des Hypertext-Charakters wurde das ganze Projekt World Wide Web (<i>weltweites Netz</i>) getauft.
<p>
HTML lag zun&auml;chst als Internet-Draft vor. Das ist eine alte Tradition im Internet. Es handelt sich dabei um Dokumente mit Standardisierungs- oder Neuerungsvorschl&auml;gen f&uuml;r internet-weite Belange. Gleichzeitig wurde bereits begonnen, WWW-Server einzurichten, die das neue HTTP-Protokoll unterst&uuml;tzten. Parallel dazu wurden Programme f&uuml;r Endanwender entwickelt. Software-Entwickler wurden von der Idee des WWW angesteckt und entwickelten fieberhaft die ersten WWW-Browser.



<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a2"><h2><font color=#6666CC>Der Boom</font></h2></a>

<img src="xmarc.jpg" width=60 height=100 border=0 alt="Marc Andreessen" align=left hspace=20>Besonders aktiv war ein junger Mann namens <img src="xgonline.gif"  width=14 height=10>&nbsp;<a href="http://home.netscape.com/people/marca/"><b>Marc Andreessen</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0>. Er entwickelte den ersten WWW-Browser f&uuml;r grafische Benutzeroberfl&auml;chen, den Browser <i>Mosaic</i>. Die Programmierer von Mosaic erfanden auch neue Features, die sie in ihren WWW-Browser implementierten, ohne da&szlig; diese Features in der HTML-Draft verzeichnet waren. Doch andererseits wurde haupts&auml;chlich dadurch jene Lawine ins Rollen gebracht, die wir heute erleben. Marc Andreessen, der den Boom fr&uuml;hzeitig witterte, stieg schlie&szlig;lich aus dem Mosaic-Projekt aus und wurde Mitbegr&uuml;nder einer neuen Firma f&uuml;r WWW-Software: Netscape. 
<p>
W&auml;hrend HTML noch immer nicht offiziell standardisiert war, brachten einflu&szlig;reiche Bl&auml;tter wie die New York Times in der zweiten Jahresh&auml;lfte 1993 Artikel &uuml;ber das neue Fieber in der Internet-Gemeinde. Die Anzahl der Schaulustigen wuchs, ebenso wie die Anzahl von Server-Betreibern im Internet, die sich die frei verf&uuml;gbare HTTP-Software installierten und damit WWW-f&auml;hig wurden. Hunderte, tausende Menschen mit Internet-Zugang und Zugang zu Servern begannen, HTML f&uuml;rs WWW zu schreiben, Wissenschaftliches, aber auch Pers&ouml;nliches, Abstruses, Verr&uuml;cktes.
<p>
<img src="xdan.jpg" width=86 height=129 border=0 alt="Dan Conolly" align=left hspace=10>Je mehr sich HTML verbreitete, desto dringlicher wurde eine Normierung. Die Bestrebungen hierzu sind vor allem <img src="xgonline.gif"  width=14 height=10>&nbsp;<a href="http://www.w3.org/pub/WWW/People/W3Cpeople.html#Connolly"><b>Dan Conolly</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0> zu verdanken, der in SGML bewandert war (SGML ist bereits seit Mitte der 80er Jahre standardisiert) und aus HTML eine SGML-konforme Sprache machte. Den ersten beiden Versionen von HTML fehlte jedoch noch vieles, was sich Entwickler w&uuml;nschten. Als sich auch namhafte Software-Hersteller in den Boom einmischten, begann ein Kampf um das Prestige der besten Browser-Software, der immer auch mit dem Mittel betrieben wurde, neue HTML-Elemente in die eigene Software zu integrieren, ohne Absprache mit dem <img src="xgonline.gif"  width=14 height=10>&nbsp;<a href="http://www.w3.org/"><b>W3-Konsortium</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0> zu halten, das sich um die Normierungsbelange im WWW k&uuml;mmert. Netscape war in dieser Politik der &quot;propriet&auml;ren HTML-Tags&quot; lange f&uuml;hrend, doch heute geht Microsoft eher noch agressiver zu Werke. 
<p>
Mittlerweile treffen deshalb im WWW und in Sachen HTML drei Welten aufeinander: die geordnete Welt der internationalen Normierungsgremien, die chaotische Welt der kreativen Genies im Internet, und die profitorientierte Welt der gro&szlig;en Software-Firmen. Der jetzt aktuelle HTML-Standard 3.2 ist ein Kompromi&szlig; zwischen den verschiedenen Parteien. Doch auch dieser Sprachstandard l&auml;&szlig;t noch viele W&uuml;nsche offen, weshalb HTML wohl auch in absehbarer Zukunft noch eine Waffe im Schlachtfeld der kommerziellen Anbieter bleiben wird, die durch die Schaffung von de-facto-Standards ihre F&uuml;hrungsrolle im Zukunftsmarkt WWW sichern wollen.
<p>
Der aktuelle Sprachstandard von HTML 3.2 datiert vom 7. Mai 1996, die aktuelle Referenz-Spezifikation vom 5. November 1996. Nachdem es innerhalb des W3-Konsortiums nie zu einer Einigung &uuml;ber den seit mehr als einem Jahr geplanten und etwas zu sehr von der Praxis abweichenden Sprachstandard 3.0 gekommen war, hat man sich gemeinsam mit den Firmen Netscape, Novell, SoftQuad, Spyglass und Sun Microsystems auf den neuen Standard 3.2 geeinigt. Inzwischen sind schon weitere Bestrebungen im gange. DasW3-Konsortium engagiert sich vor allem f&uuml;r die offizielle Einf&uuml;hrung der <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tcj.htm"><b>Style-Sheets</b></a> (Formatvorlagen f&uuml;r Abs&auml;tze) in HTML. Auch die Unterst&uuml;tzung mathematischer Formelsprache wird weiterhin diskutiert. Die &Uuml;bernahme der so beliebten und derzeit noch inoffiziellen <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tci.htm"><b>Frames</b></a> steht ebenfalls auf dem Programm. Einsicht in all diese Bestrebungen und zu allen offiziellen Dokumenten erhalten Sie &uuml;ber die Einstiegsseite <img src="xgonline.gif"  width=14 height=10>&nbsp;<a href="http://www.w3.org/pub/WWW/MarkUp/"><b>Hypertext Markup Language</b></a>&nbsp;<img src="xeng.gif" width=16 height=10 border=0> auf dem Server des W3-Konsortiums.



<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<table>
<tr><td></td><td colspan=2 align=center><font size=-1>Bl&auml;ttern:</font></td><td></td></tr>
<tr>
<td><a href="tbaa.htm"><b>HTML als Dokumentbeschreibungssprache</b></a></td>
<td><img  src="x3.gif" width=15 height=10 border=0>&nbsp;<img  src="xgprev.gif" width=10 height=10 border=0></td>
<td align=right><img  src="xgnext.gif" width=10 height=10 border=0>&nbsp;<img  src="x3.gif" width=15 height=10 border=0></td>
<td><a href="tbac.htm"><b>Ein paar pers&ouml;nliche Ansichten zu HTML</b></a></td>
</tr>
</table>
<p>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tb.htm"><b>Einf&uuml;hrung</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tba.htm"><b>Allgemeines zu HTML</b></a></td>
</tr>
</table>
<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>







