<html>
<head>
<title>SELFHTML: Ein paar pers&ouml;nliche Ansichten zu HTML</title>
</head>
<body bgcolor=#FFFFFF text=#000000 link=#CC6633 vlink=#993300 alink=#6666CC>

<a name="top">&#160;</a>
<table cellpadding=0>
<tr>
<td><img src="xweb.gif" width=106 height=109></td>
<td>
<table>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tb.htm"><b>Einf&uuml;hrung</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tba.htm"><b>Allgemeines zu HTML</b></a></td>
</tr>
</table>
</td>
</tr>
</table>
<h1><font color=#6666CC>Ein paar pers&ouml;nliche Ansichten zu HTML</font></h1>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a1"><b>Wieviel Sie &uuml;ber HTML wissen sollten</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>Vom Dateiformat zur Universalsprache</b></a><br>
<img src="xgdown.gif" width=14 height=10 border=0>&nbsp;<a href="#a2"><b>HTML und die wichtigste Erkenntnis unserer Zeit</b></a><br>
<p>
<hr noshade  size=1 width=50% align=left color=#6666CC>


<spacer type=vertical size=30>
<a name="a1"><h2><font color=#6666CC>Wieviel Sie &uuml;ber HTML wissen sollten</font></h2></a>
Mittlerweile ist die zweite Generation von WYSIWYG-Editoren (WYSIWYG = <b>W</b>hat <b>Y</b>ou <b>S</b>ee <b>I</b>s <b>W</b>hat <b>Y</b>ou <b>G</b>et) f&uuml;r HTML auf dem Markt. Das sind Editoren, die die Kenntnis von HTML-Befehlen weitgehend &uuml;berfl&uuml;ssig machen. Das Editieren von HTML-Dateien geschieht damit in einer Umgebung, die sich kaum oder gar nicht vom Pr&auml;sentationsmodus unterscheidet. Solche Editoren sind mittlerweile zumindest so ausgereift, da&szlig; Sie damit schon recht attratktiv aussehende Seiten f&uuml;rs WWW erstellen k&ouml;nnen. 
<p>
Die meisten Profis und auch viele Laien bevorzugen jedoch weiterhin das direkte Editieren der HTML-Dateien mit einem ASCII-Editor oder einem ASCII-basierten HTML-Editor. Denn nur solche Editoren bieten die volle Freiheit bei der Gestaltung eigener WWW-Seiten. Vor allem beim Einbinden von <img src="x1.gif" width=15 height=13 border=0>&nbsp;<a href="td.htm"><b>JavaScript</b></a> gibt es derzeit noch keine Alternative zu diesem Editiermodus. Der direkte Umgang mit HTML-Befehlen sch&auml;rft zudem den Blick f&uuml;r die Beziehung zwischen dem, was in der Datei steht, und dem, was ein WWW-Browser daraus macht. Da es bei modernen grafischen und multitasking-f&auml;higen Arbeitsumgebungen auch kein Problem ist, schnell zwischen Editier- und Pr&auml;sentierprogramm hin und her zu wechseln, ist die st&auml;ndige Kontrolle beim Editieren bequem m&ouml;glich. 
<p>
<b>Fazit:</b> Sie m&uuml;ssen nichts mehr &uuml;ber HTML wissen, wenn Sie sich einen WYSIWYG-Editor besorgen und sich mit den meist zahlreichen M&ouml;glichkeiten zufrieden geben, die der betreffende Editor bietet. Wenn Sie aber gerade den Effekt lieben, den das Setzen von ein paar HTML-Befehlen auf die Pr&auml;sentation hat, oder wenn Sie keine Kompromisse bei der Gestaltungsfreiheit machen wollen, dann ist es auch weiterhin wichtig, sich mit der Sprache HTML zu besch&auml;ftigen. 
<p>
(siehe auch <img src="x3.gif" width=15 height=10 border=0>&nbsp;<a href="tbda.htm"><b>HTML-Editoren</b></a>)




<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a2"><h2><font color=#6666CC>Vom Dateiformat zur Universalsprache</font></h2></a>
<img src="xmoz.jpg" width=120 height=120 border=0 alt="Mozilla schreibt in HTML" align=left hspace=10>Dank WWW ist HTML, die kleine, hypertext-orientierte Schwester von SGML, 
in aller Munde. In jeder Fachzeitschrift ist zu lesen, daß HTML die Sprache des WWW sei.
<p>
Zweifellos ist sie das, und ihre Bedeutung zieht sie heute vor allem aus dieser Tatsache. Aber HTML-Dateien liegen schon l&auml;ngst nicht mehr nur auf den WWW-Servern des Internet herum. Jeder, der einen WWW-Browser hat, legt HTML-Dateien auf dem eigenen Rechner ab. Viele 
Anwender, die einen zeitabh&auml;ngigen Internet-Zugang haben, speichern interessante HTML-Seiten gleich lokal ab und lesen sie hinterher offline. Auch in Mailboxen liegen HTML-Dateien zum Download bereit, meistens Dateien mit Verweisen zu interessanten Stellen im WWW. Auch auf einschl&auml;gigen CD-ROMs werden k&uuml;nftig immer mehr HTML-Dateien 
zu finden sein.
<p>
Immer wichtiger wird HTML auch f&uuml;r &quot;Intranets&quot;, also f&uuml;r LAN- und WAN-Netze von Firmen und Organisationen, die der &Ouml;ffentlichkeit nicht zug&auml;nglich sind. F&uuml;hrende Software-Produkte in diesem Bereich wie Lotus Notes setzen bereits auf die HTML-Technik. Es ist auch zu erwarten, da&szlig; HTML das Microsoft-Dateiformat RTF (Rich Text Format) verdr&auml;ngt. HTML wird sich wohl als Standard-Format f&uuml;r E-Mails im Internet und in Intranets durchsetzen. 
<p>
In wenigen Jahren wird es wohl kaum einen Personal Computer und keine Workstation
mehr geben, auf der nicht ein WWW-Browser oder ein vergleichbares HTML-Pr&auml;sentationswerkzeug installiert sein wird. HTML wird zum zweitkleinsten gemeinsamen Nenner jenseits des ASCII-Zeichensatzes werden. Firmenpr&auml;sentationen, Handb&uuml;cher, Fachliteratur, ganze Dokumentarchive werden online, auf CDs oder anderen Datentr&auml;gern in HTML-Form zur Verf&uuml;gung  stehen. HTML ist in den 90er Jahren das, was die CompactDisc (CD) in den 80ern war: ein Selbstl&auml;ufer, der ganz zwanglos zum Ma&szlig; aller Dinge wird. HTML wird den Sprung vom blo&szlig;en Dateiformat zur Universalsprache schaffen.




<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a><spacer type=vertical size=30>
<a name="a3"><h2><font color=#6666CC>HTML und die wichtigste Erkenntnis unserer Zeit</font></h2></a>
Die wichtigste Erkenntnis unserer Zeit lautet (frei nach Murphy): es gibt kein endg&uuml;ltiges Wissen, im entscheidenden Moment gibt es immer nur Querverweise.
<p>
Um diesem Umstand gerecht zu werden, brauchen wir etwas, das die Querverweise zum Prinzip erhebt. Wir haben es auch schon gefunden und &quot;Hypertext&quot; genannt.
<p>
Hypertext ist Text mit Zeigern auf anderen Text. Viel mehr steckt zun&auml;chst wirklich nicht dahinter. Das ist nichts anderes, als wenn Sie in einer Bibliothek anfangen, in einem Buch &uuml;ber ein 
interessantes Thema zu lesen. Sie erfahren einiges, aber l&auml;ngst nicht alles, was Sie wissen wollten. Nun enth&auml;lt das Buch Angaben zu weiterf&uuml;hrender Literatur, und Sie qu&auml;len sich damit 
ab, diese Literatur aufzutreiben. Sie geben Fernleihen auf und warten wochenlang auf das begehrte Schriftst&uuml;ck. 
<p>
Bei Hypertext ist der Verweis auf die weiterf&uuml;hrende Literatur mit der Maus anklickbar, und wenn Sie draufklicken, sind Sie sofort in dem gew&uuml;nschten Dokument. Das ist, salopp gesagt, der einzige, allerdings 
entscheidende Unterschied zu herk&ouml;mmlichen Textmedien. Alles ist verf&uuml;gbar im Augenblick des spontanen Interesses. Hypertext hat also etwas mit den gebratenen Tauben zu tun, die einem im Schlaraffenland in den Mund fliegen.
<p>
Seit Mitte der 60er Jahre besch&auml;ftigt das &quot;Ph&auml;nomen Hypertext&quot; die Geister. Das Problem war immer nur, wo man all die viele Information speichern soll, die in so einem paradiesischen Hypertext 
auf Knopfdruck zur Verf&uuml;gung stehen soll. Die Antwort: auf irgendeinem x-beliebigen Rechner, wenn er denn in der Lage ist, als Internet-Server zu fungieren. 
<p>
Es hat erstaunlich lange gedauert, bis man auf diese Antwort kam. Aber jetzt ist sie da, in Form des World Wide Web. Und HTML ist sozusagen die technische Grundlage für das Prinzip der gebratenen Querverweis-Tauben.
<p>
In diesem Dokument haben Sie Gelegenheit, sich n&auml;her damit zu besch&auml;ftigen.




<p><a href="#top"><img src="xgoup2.gif" width=15 height=19 border=0></a>
<p>
<hr noshade  size=4 width=50% align=left color=#6666CC>
<p>

<table>
<tr><td></td><td colspan=2 align=center><font size=-1>Bl&auml;ttern:</font></td><td></td></tr>
<tr>
<td><a href="tbab.htm"><b>Geschichte von HTML</b></a></td>
<td><img  src="x3.gif" width=15 height=10 border=0>&nbsp;<img  src="xgprev.gif" width=10 height=10 border=0></td>
<td align=right><img  src="xgnext.gif" width=10 height=10 border=0>&nbsp;<img  src="x3.gif" width=15 height=10 border=0></td>
<td><a href="tbad.htm"><b>Infos zu HTML im Internet</b></a></td>
</tr>
</table>
<p>
<table cellpadding=0>
<tr>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=3><a href="selfhtml.htm"><b>HTML-Dateien selbst erstellen</b></a></td>
</tr>
<tr>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td colspan=2><a href="tb.htm"><b>Einf&uuml;hrung</b></a></td>
</tr>
<tr>
<td></td>
<td></td>
<td><img  src="x2.gif" width=16 height=13 border=0></td>
<td><a href="tba.htm"><b>Allgemeines zu HTML</b></a></td>
</tr>
</table>
<p>

<address>&copy; 1997 <img src="xgmail.gif" width=15 height=10 border=0>&nbsp;<a href="mailto:s.muenz@euromail.com">Stefan M&uuml;nz, s.muenz@euromail.com</a></address><p>

</body>
</html>







